[
    {
        "course_title": "STAT 151 - Introduction to Applied Statistics I",
        "description": "Data collection and presentation, descriptive statistics. Probability distributions, sampling distributions and the central limit theorem. Point estimation and hypothesis testing. Correlation and regression analysis. Goodness of fit and contingency table.  Notes: (1) Credit can be obtained in at most one of STAT 151, STAT 161, and STAT 235. (2) This course may not be taken for credit if credit has been obtained in STAT 222, STAT 266, STAT 276, KIN 109, PEDS 109, PSYCH 211, PTHER 352, SCI 151 or SOC 210.",
        "prerequisites": [
            {
                "All of": [
                    "Mathematics 30-1 or 30-2"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 161 - Introductory Statistics for Business and Economics",
        "description": "Data collection and presentation, descriptive statistics. Probability distributions, sampling distributions and the central limit theorem. Point estimation and hypothesis testing. Correlation and regression analysis. Goodness of fit and contingency table. Use of a microcomputer software package for statistical analyses in business and economics.  Notes: (1) Credit can be obtained in at most one of STAT 151, STAT 161, and STAT 235. (2) This course may not be taken for credit if credit has been obtained in obtained in STAT 222, STAT 266, STAT 276, KIN 109, PEDS 109, PSYCH 211, PTHER 352, SCI 151 or SOC 210.",
        "prerequisites": [
            {
                "All of": [
                    "Mathematics 30-1 or 30-2"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 181 - Introduction to Combinatorics and Probability",
        "description": "Induction; principles of counting, multinomial coefficients, negative binomial distribution; maximum likelihood estimation, probability axioms; conditional probability, Bayes' rule; independence; probability mass, distribution, and moment generating functions; strong law of large numbers; conditional expectation estimators; gambler's ruin; transience and recurrence; compound processes; applications.   Notes: (1) Credit can be obtained in at most two of STAT 181, STAT 265, or STAT 281. (2) Credit cannot be obtained in STAT 181 if credit has already been obtained in MATH 181.",
        "prerequisites": [
            {
                "One of": [
                    "MATH 125",
                    "MATH 127"
                ]
            }
        ],
        "corequisites": [
            {
                "One of": [
                    "MATH 101",
                    "MATH 118",
                    "MATH 136",
                    "MATH 146",
                    "MATH 156"
                ]
            }
        ]
    },
    {
        "course_title": "STAT 235 - Introductory Statistics for Engineering",
        "description": "Descriptive data analysis. Calculus of Probability. Binomial, multinomial, Poisson, normal, beta, exponential, gamma, hypergeometric, and Weibull distributions. Sampling distributions. Estimation, testing hypotheses, goodness-of-fit tests, and one-way analysis of variance. Linear correlation and regression. Sampling. Quality control. Use of a microcomputer software package for statistical analyses in engineering applications.   Notes: (1) This course may not be taken for credit if credit has already been obtained in one of STAT 151, 161, 222, 265, 266, 276, 281; KIN 109, PEDS 109, PSYCH 211, PTHER 352, SCI 151 or SOC 210. (2) Intended for Engineering students. (2) Intended for Engineering students. Other students who take this course will receive 3.0 units.",
        "prerequisites": [
            {
                "All of": [
                    "MATH 100"
                ]
            }
        ],
        "corequisites": [
            {
                "All of": [
                    "MATH 101"
                ]
            }
        ]
    },
    {
        "course_title": "STAT 235A - Introductory Statistics for Engineering",
        "description": "Descriptive data analysis. Calculus of Probability. Binomial, multinomial, Poisson, normal, beta, exponential, gamma, hypergeometric, and Weibull distributions. Sampling distributions. Estimation, testing hypotheses, goodness-of-fit tests, and one-way analysis of variance. Linear correlation and regression. Sampling. Quality control. Use of a microcomputer software package for statistical analyses in engineering applications.   Notes: (1) This course may not be taken for credit if credit has already been obtained in one of STAT 151, 161, 222, 265, 266, 276, 281; KIN 109, PEDS 109, PSYCH 211, PTHER 352, SCI 151 or SOC 210. (2) Intended for Engineering students. (2) Intended for Engineering students. Other students who take this course will receive 3.0 units.",
        "prerequisites": [
            {
                "All of": [
                    "MATH 100"
                ]
            }
        ],
        "corequisites": [
            {
                "All of": [
                    "MATH 101"
                ]
            }
        ]
    },
    {
        "course_title": "STAT 235B - Introductory Statistics for Engineering",
        "description": "Descriptive data analysis. Calculus of Probability. Binomial, multinomial, Poisson, normal, beta, exponential, gamma, hypergeometric, and Weibull distributions. Sampling distributions. Estimation, testing hypotheses, goodness-of-fit tests, and one-way analysis of variance. Linear correlation and regression. Sampling. Quality control. Use of a microcomputer software package for statistical analyses in engineering applications.   Notes: (1) This course may not be taken for credit if credit has already been obtained in one of STAT 151, 161, 222, 265, 266, 276, 281; KIN 109, PEDS 109, PSYCH 211, PTHER 352, SCI 151 or SOC 210. (2) Intended for Engineering students. (2) Intended for Engineering students. Other students who take this course will receive 3.0 units.",
        "prerequisites": [
            {
                "All of": [
                    "MATH 100"
                ]
            }
        ],
        "corequisites": [
            {
                "All of": [
                    "MATH 101"
                ]
            }
        ]
    },
    {
        "course_title": "STAT 252 - Introduction to Applied Statistics II",
        "description": "Methods in applied statistics including regression techniques, analysis of variance and covariance, and methods of data analysis. Applications are taken from Biological, Physical and Social Sciences, and Business.  Notes: (1) Credit can be obtained in at most one of STAT 252, 319, 337 or 341, or AREC 313. (2) This course may not be taken for credit if credit has already been obtained in STAT 368 or 378.",
        "prerequisites": [
            {
                "One of": [
                    "STAT 141",
                    "STAT 151",
                    "STAT 161",
                    "STAT 235",
                    "SCI 151"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 265 - Probability and Statistics I",
        "description": "Sample space, events, combinatorial probability, conditional probability, independent events, Bayes Theorem, random variables, discrete random variables, expected values, moment generating function, inequalities, continuous distributions, multivariate distributions, independence.  Note: Credit can be obtained in at most two of MATH 181, MATH 281, or STAT 265.",
        "prerequisites": [],
        "corequisites": [
            {
                "One of": [
                    "MATH 209",
                    "MATH 214",
                    "MATH 217"
                ]
            }
        ]
    },
    {
        "course_title": "STAT 266 - Probability and Statistics II",
        "description": "Functions of random variables, sampling distributions, Central Limit Theorem, law of large numbers, statistical models for the data, likelihood, parameters and their interpretation, objectives of statistical inference, point and interval estimation, method of moments, basic notions of testing of hypotheses, errors of the first and second kind, significance level, power, p-value.   Credit can only be obtained in one of STAT 266 or STAT 276.",
        "prerequisites": [
            {
                "One of": [
                    "MATH 209",
                    "MATH 214",
                    "MATH 217"
                ]
            },
            {
                "One of": [
                    "STAT 265",
                    "MATH 281"
                ]
            }
        ],
        "corequisites": [
            {
                "One of": [
                    "MATH 225",
                    "MATH 227"
                ]
            }
        ]
    },
    {
        "course_title": "STAT 276 - Statistics for Data Science",
        "description": "Fundamental principles of statistical learning and inference for data science Understanding of types of analytics, probability, variability, relationship between variables, probability distributions, law of large numbers, Central Limit Theorem, hypothesis testing and statistical significance, and elementary theory of regression.  Students presenting STAT 265 must also present one of MATH 117 or MATH 216 as corequisite. Credit can only be obtained in one of STAT 266 or STAT 276.",
        "prerequisites": [
            {
                "All of": [
                    "MATH 281 or STAT 265"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 281 - Probability by Counting and Queuing",
        "description": "Review of binomial and negative binomial distributions; continuous random variables; uniform, exponential, and gamma distributions; conditional probability; properties of conditional expectation; stochastic processes; finite-dimensional distributions, Poisson approximation; Poisson measures; counting processes, Markov queues, customer time in queues; steady-state distributions; applications.  Notes: (1) Credit can be obtained in at most two of STAT 181, STAT 265, or STAT 281. (2) Credit cannot be obtained in STAT 281 if credit has already been obtained in STAT 371.",
        "prerequisites": [],
        "corequisites": [
            {
                "One of": [
                    "MATH 209",
                    "MATH 214",
                    "MATH 217"
                ]
            }
        ]
    },
    {
        "course_title": "STAT 337 - Biostatistics",
        "description": "Methods of data analysis useful in Biostatistics including analysis of variance and covariance and nested designs, multiple regression, logistic regression and log-linear models. The concepts will be motivated by problems in the life sciences. Applications to real data will be emphasized through the use of a computer package.  Notes : (1) Credit can be obtained in at most one of STAT 252, STAT 337, and AREC 313. (2) This course may not be taken for credit if credit has already been obtained in STAT 368 or 378.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 151",
                    "STAT 161",
                    "or SCI 151",
                    "a 200-level Biological Science course"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 353 - Life Contingencies I",
        "description": "Time at death random variables, continuous and discrete insurances, endowments and varying annuities, net premiums and reserves.",
        "prerequisites": [
            {
                "One of": [
                    "STAT 265",
                    "MATH 281"
                ]
            },
            {
                "All of": [
                    "MATH 253"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 361 - Sampling Techniques",
        "description": "Simple random sampling from finite populations, stratified sampling, regression estimators, cluster sampling.  Note: This course may only be offered in alternate years.",
        "prerequisites": [
            {
                "One of": [
                    "STAT 266",
                    "STAT 276",
                    "STAT 235 with consent of the Department"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 368 - Introduction to Design and Analysis of Experiments",
        "description": "Basic principles of experimental design, completely randomized design-one way ANOVA and ANCOVA, randomized block design, Latin square design, Multiple comparisons. Nested designs. Factorial experiments.",
        "prerequisites": [
            {
                "One of": [
                    "STAT 266",
                    "STAT 276",
                    "STAT 235 with consent of the Department"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 371 - Probability and Stochastic Processes",
        "description": "Problem solving of classical probability questions, random walk, gambler's ruin, Markov chains, branching processes. Selected topics of the instructor's choice.  Note: Credit can be obtained in at most one of MATH 281 or STAT 371.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 265"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 372 - Mathematical Statistics",
        "description": "Laws of large numbers, weak convergence, some asymptotic results, delta method, maximum likelihood estimation, testing, UMP tests, LR tests, nonparametric methods (sign test, rank test), robustness, statistics and their sensitivity properties, prior and posterior distributions, Bayesian inference, conjugate priors, Bayes estimators.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 266 or STAT 276"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 378 - Applied Regression Analysis",
        "description": "Simple linear regression analysis, inference on regression parameters, residual analysis, prediction intervals, weighted least squares. Multiple regression analysis, inference about regression parameters, multicollinearity and its effects, indicator variables, selection of independent variables. Non-linear regression.",
        "prerequisites": [
            {
                "One of": [
                    "STAT 266",
                    "STAT 276",
                    "STAT 235 with consent of the Department"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 413 - Computing for Data Science",
        "description": "Survey of contemporary languages/environments suitable for algorithms of Statistics and Data Science. Introduction to Monte Carlo methods, random number generation and numerical integration in statistical context and optimization for both smooth and constrained alternatives, tailored to specific applications in statistics and machine learning.",
        "prerequisites": [
            {
                "One of": [
                    "STAT 265",
                    "MATH 281",
                    "consent of the Department"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 432 - Survival Analysis",
        "description": "Survival models, model estimation from complete and incomplete data samples, parametric survival models with concomitant variables, estimation of life tables from general population data.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 372",
                    "STAT 378"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 437 - Applied Statistical Methods",
        "description": "Methods of data analysis useful in applied research, including repeated measures and longitudinal data analysis, non-linear regression, survival analysis, multivariate techniques. Applications to real data will be emphasized, including case studies and real data applications. Each researcher works on a project to present, highlighting the methods used in the project.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 252 or 337 or consent of the instructor"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 441 - Statistical Methods for Learning and Data Mining",
        "description": "Review of linear and nonlinear regression and brief introduction to generalized linear models, the course covers selected methods of dimension reduction (principal components, factor analysis, canonical correlations), of unsupervised (clustering, multidimensional scaling ordination) and supervised classification (discriminant analysis, logistic regression, nearest neighbours - including, among others, the machine learning methods like classification trees, neural networks, and support vector machines).",
        "prerequisites": [
            {
                "All of": [
                    "STAT 378"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 453 - Risk Theory",
        "description": "Classical ruin theory, individual risk models, collective risk models, models for loss severity: parametric models, tail behavior, models for loss frequency, mixed Poisson models; compound Poisson models, convolutions and recursive methods, probability and moment generating functions.",
        "prerequisites": [
            {
                "One of": [
                    "STAT 371",
                    "MATH 281"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 471 - Probability I",
        "description": "Probability spaces, algebra of events. Elements of combinatorial analysis. Conditional probability, stochastic independence. Special discrete and continuous distributions. Random variables, moments, transformations. Basic limit theorems.",
        "prerequisites": [
            {
                "One of": [
                    "STAT 371",
                    "MATH 281"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 479 - Time Series Analysis",
        "description": "Stationary series, spectral analysis, models in time series: autoregressive, moving average, ARMA and ARIMA. Smoothing series, computational techniques and computer packages for time series.  Note: This course may only be offered in alternate years.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 372",
                    "STAT 378"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 497 - Reading in Statistics",
        "description": "This course is designed to give credit to mature and able students for reading in areas not covered by courses, under the supervision of a staff member. A student, or group of students, wishing to use this course should find a staff member willing to supervise the proposed reading program. A detailed description of the material to be covered should be submitted to the Chair of the Department Honors Committee. (This should include a description of testing methods to be used.) The program will require the approval of both the Honors Committee, and the Chair of the Department. The students' mastery of the material of the course will be tested by a written or oral examination. This course may be taken in Fall or Winter and may be taken any number of times, subject always to the approval mentioned above.",
        "prerequisites": [
            {
                "All of": [
                    "Any 300-level STAT course"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 498 - Statistical Topics in Data Science",
        "description": "This topics course is designed for new course offerings that may be offered in a given term.  Additional prerequisites may be required. Note: Credit for this course may be obtained more than once.",
        "prerequisites": [
            {
                "One of": [
                    "STAT 266",
                    "STAT 276"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 499 - Research Project",
        "description": "This course provides students in Specialization and Honors programs an opportunity to pursue research in statistics under the direction of a member of the Department. Course requirements include at least one oral presentation and a written final report. Students interested in taking this course should contact the course coordinator two months in advance. Credit for this course may be obtained more than once.",
        "prerequisites": [
            {
                "All of": [
                    "a 300-level STAT course",
                    "consent of the course coordinator"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 501 - Directed Study I",
        "description": "Basic principles of experimental design, completely randomized design-one way ANOVA and ANCOVA. Randomized block design. Latin square design, Multiple comparisons. Nested designs. Factorial experiments. Each student will give a written report and seminar presentation highlighting statistical methods used in a research project.  Note: Cannot be used for credit towards a graduate program in Statistics.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 252 or 337 or equivalent",
                    "a course in linear algebra"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 502 - Directed Study II",
        "description": "Simple linear regression analysis, inference on regression parameters, residual analysis, prediction intervals, weighted least squares. Multiple regression analysis, inference about regression parameters, multicollinearity and its effects, indicator variables, selection of independent variables. Non-linear regression. Each student will give a written report and seminar presentation highlighting statistical methods used in a research project.  Note: Cannot be used for credit towards a graduate program in Statistics.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 337 or equivalent",
                    "a course in linear algebra"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 503 - Directed Study III",
        "description": "Theory and applications of time series modelling, stationarity, autocorrelation. Spectral properties, filtering. Box-Jenkins models, seasonality. Each student will give a written report and seminar presentation highlighting statistical methods used in a research project.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 372",
                    "378 or consent of Instructor"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 504 - Directed Study IV",
        "description": "Basic sampling schemes for finite populations: simple random sampling, stratified random sampling, systematic sampling and cluster sampling. Unequal probability sampling. Ratio and regression estimators.  Note: Cannot be used for credit towards a graduate program in Statistics.",
        "prerequisites": [
            {
                "All of": [
                    "A course in Statistical Inference at the 300 level or permission from the instructor"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 505 - Directed Study V",
        "description": "Principles of statistical model building and analysis applied in linear and generalized linear models and illustrated through multivariate methods such as repeated measures, principal components, and supervised and unsupervised classification. Each student will give a written report and seminar presentation highlighting statistical methods used in a research project.  Note: Cannot be used for credit towards a thesis-based graduate program in Statistics.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 501",
                    "502 or equivalent"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 512 - Techniques of Mathematics for Statistics",
        "description": "Introduction to mathematical techniques commonly used in theoretical Statistics, with applications. Applications of diagonalization results for real symmetric matrices, and of continuity, differentiation, Riemann-Stieltjes integration and multivariable calculus to the theory of Statistics including least squares estimation, generating functions, distribution theory.",
        "prerequisites": [
            {
                "All of": [
                    "consent of Department"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 513 - Statistical Computing",
        "description": "Introduction to contemporary computational culture: reproducible coding, literate programming. Monte Carlo methods: random number generation, variance reduction, numerical integration, statistical simulations. Optimization (linear search, gradient descent, Newton-Raphson, method of scoring, and their specifics in the statistical context), EM algorithm. Fundamentals of convex optimization with constraints.",
        "prerequisites": [
            {
                "All of": [
                    "consent of the instructor"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 514 - Statistics for Clinical Trials I",
        "description": "This course is designed to equip students with essential statistical knowledge and skills necessary for the successful clinical trial design and analysis. This course covers a wide range of statistical topics specific to clinical trials, including intention-to-treat versus efficacy trials, principles of sampling and exclusion, methods of allocation and techniques of randomization, parallel versus cross over design, cluster randomization designs, statistical analysis planning, external and internal validation, and reports of statistical findings. Additionally, the course will explore other selected topics related to logistical issues in the management of clinical trials.  Notes: Students outside of the course-based MSc with a specialization in Biostatistics need permission from the Department to enroll in this course. Thesis-based graduate students in Mathematical and Statistical Sciences cannot take this course for credit.",
        "prerequisites": [
            {
                "All of": [
                    "consent of the instructor"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 515 - Statistics for Clinical Trials II",
        "description": "This course is a continuation of Statistics for Clinical Trials I, with a focus on statistical computation and data analysis techniques specifically tailored for clinical trials. Students will work with the R and SAS statistical programming languages to gain a comprehensive understanding of these methods in the clinical trials context. The primary goal is to equip graduate students with the statistical skills required for data analysis in clinical trials. Successful students will become proficient in using statistical computational tools to analyze real-world clinical datasets and will be exposed to advanced statistical techniques and best practices for data storage, management, and analysis. Key statistical topics covered in this course include sampling designs, chi-square tests, linear models, mixed-effects models for repeated measurements and survival analysis.  Notes: Students outside of the course-based MSc with a specialization in Biostatistics need permission from the Department to enroll in this course. Thesis-based graduate students in Mathematical and Statistical Sciences cannot take this course for credit.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 514"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 532 - Survival Analysis",
        "description": "Survival and hazard functions, censoring, truncation. Non-parametric, parametric and semi-parametric approaches to survival analysis including Kaplan-Meier estimation and Cox's proportional hazards model.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 372 or consent of Department"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 537 - Statistical Methods for Applied Research II",
        "description": "Review of basic statistical concepts of inference and probability theory. Includes applied methods of Linear and non-linear regression and analysis of variance for designed experiments, multiple comparisons, correlations, modeling and variable selection, multicollinearity, predictions, confounding and Simpson's paradox. Includes case studies and real data applications. Each researcher works on a project to present, highlighting the methods used in the project.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 437 equivalent or consent of the instructor"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 541 - Statistics for Learning",
        "description": "The course focuses on statistical learning techniques, in particular those of supervised classification, both from statistical (logistic regression, discriminant analysis, nearest neighbours, and others) and machine learning background (tree-based methods, neural networks, support vector machines), with the emphasis on decision-theoretic underpinnings and other statistical aspects, flexible model building (regularization with penalties), and algorithmic solutions. Selected methods of unsupervised classification (clustering) and some related regression methods are covered as well.",
        "prerequisites": [
            {
                "All of": [
                    "Consent of the instructor"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 553 - Risk Theory",
        "description": "Classical ruin theory, individual risk models, collective risk models, models for loss severity: parametric models, tail behavior, models for loss frequency, mixed Poisson models; compound Poisson models, convolutions and recursive methods, probability and moment generating functions.  Note: Cannot be used for credit towards a thesis-based graduate program in the Department of Mathematical and Statistical Sciences.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 371 or equivalent"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 561 - Sample Survey Methodology",
        "description": "Review of basic sampling schemes: simple random sampling, and stratified random sampling, and systematic sampling. Multistage sampling schemes. Estimation of nonlinear parameters: ratios, regression coefficients, and correlation coefficients. Variance estimation techniques: linearization, BRR, jackknife, and bootstrap. Selected topics: model-based estimation, regression analysis from complex survey data. Relevant computer packages.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 361",
                    "STAT 372",
                    "STAT 471"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 562 - Discrete Data Analysis",
        "description": "Sampling models and methods of inference for discrete data. Maximum likelihood estimation for complete contingency tables, measures of association and agreement. Goodness-of-fit. Incomplete tables. Analysis of square tables; symmetry and marginal homogeneity. Model selection and closeness of fit; practical aspects. Chi-square tests for categorical data from complex surveys.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 372 or 471"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 566 - Methods of Statistical Inference",
        "description": "An introduction to the theory of statistical inference. Topics to include exponential families and general linear models, likelihood, sufficiency, ancillarity, interval and point estimation, asymptotic approximations. Optional topics as time allows, may include Bayesian methods, Robustness, resampling techniques. This course is intended primarily for MSc students.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 471 or consent of Department"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 568 - Design and Analysis of Experiments",
        "description": "The general linear model. Fully randomized designs, one-way layout, multiple comparisons. Block designs, Latin squares. Factorial designs confounding, fractions. Nested designs, randomization restrictions. Response surface methodology. Analysis of covariance.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 368",
                    "a 400-level STAT course"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 571 - Probability and Measure",
        "description": "Measure and integration, Laws of Large Numbers, convergence of probability measures. Conditional expectation as time permits.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 471",
                    "STAT 512 or their equivalents"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 575 - Multivariate Analysis",
        "description": "The multivariate normal distribution, multivariate regression and analysis of variance, classification, canonical correlation, principal components, factor analysis.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 372",
                    "STAT 512"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 578 - Regression Analysis",
        "description": "Multiple linear regression, ordinary and generalized least squares, partial and multiple correlation. Regression diagnostics, collinearity, model building. Nonlinear regression. Selected topics: robust and nonparametric regression, measurement error models.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 378",
                    "a 400-level statistics course"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 580 - Stochastic Processes",
        "description": "Elements of stochastic processes. Discrete and continuous time Markov Chains; Birth and Death processes. Branching processes. Brownian Motion. General Stationary and Markov processes. Examples.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 471 or consent of Instructor"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 590 - Statistical Consulting",
        "description": "Data analysis, problem solving, oral communication with clients, issues in planning experiments and collecting data; practical aspects of consulting and report writing.",
        "prerequisites": [],
        "corequisites": [
            {
                "All of": [
                    "STAT 568",
                    "578 or their equivalents"
                ]
            }
        ]
    },
    {
        "course_title": "STAT 600 - Reading in Statistics",
        "description": "Students will be supervised by an individual staff member to participate in areas of research interest of that staff member. Students can register only with the permission of the Chair of the Department in special circumstances. Will not be counted toward the minimum course requirement for graduate credits.",
        "prerequisites": [],
        "corequisites": []
    },
    {
        "course_title": "STAT 637 - Statistical Methods for Applied Research III",
        "description": "Advanced statistical design and methods. Topics include sampling, multivariate techniques, survival analysis, power and sample size, linear and non linear regression, longitudinal and repeated measures data, and analysis of seasonal or time series data. Topics to be covered can be influenced by the registered researchers. Includes critical review and case studies with real data applications. Each researcher works on a project to present, highlighting the methods used in the project.  Cannot be used for credit towards a graduate program in Statistics.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 537 or equivalent or consent of the instructor"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 664 - Advanced Statistical Inference",
        "description": "Modern methods of statistical inference. Various versions of likelihood:  conditional, marginal, integrated, profile, partial, empirical. Estimating equations. Semi-parametric models. Foundational issues.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 512",
                    "STAT 566"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 665 - Asymptotic Methods in Statistical Inference",
        "description": "Approximation techniques and asymptotic methods in statistics. Topics may include second and higher order expansions, asymptotics of likelihood based estimation and testing. Edgeworth expansions, exponential tilting, asymptotic relative efficiency, U-, M-, L-, and R-estimation.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 566 or 664",
                    "512 or the equivalent"
                ]
            }
        ],
        "corequisites": []
    },
    {
        "course_title": "STAT 900 - Directed Research Project",
        "description": "Open only to students taking the MSc non-thesis option in statistics.",
        "prerequisites": [],
        "corequisites": []
    },
    {
        "course_title": "STAT 900A - Directed Research Project",
        "description": "Open only to students taking the MSc non-thesis option in statistics.",
        "prerequisites": [],
        "corequisites": []
    },
    {
        "course_title": "STAT 900B - Directed Research Project",
        "description": "Open only to students taking the MSc non-thesis option in statistics.",
        "prerequisites": [],
        "corequisites": []
    },
    {
        "course_title": "STAT 901 - Practicum in Statistics I",
        "description": "Open only to students taking the MSc non-thesis option in Statistics.",
        "prerequisites": [],
        "corequisites": []
    },
    {
        "course_title": "STAT 902 - Practicum in Statistics II",
        "description": "Open only to students taking the MSc non-thesis option in Statistics.",
        "prerequisites": [],
        "corequisites": []
    },
    {
        "course_title": "STAT 903 - Internship in Biostatistics",
        "description": "Students will work on statistical clinical programming tasks through paid internships. These internships may be provided by an external company in partnership with the University of Alberta.  Notes: Enrolment in this course needs permission from the Department. Only students in the course-based MSc with a specialization in Biostatistics can get credit for this course. This course can be taken more than once for credit with approval by the Department.",
        "prerequisites": [
            {
                "All of": [
                    "STAT 515"
                ]
            }
        ],
        "corequisites": []
    }
]