[
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 200",
    "title": "Introduction to Accounting",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Provides a basic understanding of accounting: how accounting numbers are generated, the meaning of accounting reports, and how to use accounting reports to make decisions. Note: Not open to students registered in the Faculty of Business. Not for credit in the Bachelor of Commerce Program or another program that requires ACCTG 211 or 311. Not open to students with credit in ACCTG 211 or 311 and ACCTG 222 or 322. Students may not receive credit for both ACCTG 200 and ACCTG 300",
    "url": "/catalogue/course/acctg/200"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 211",
    "title": "Introduction to Accounting for Financial Performance",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-1.5S-0"
    },
    "description": "How to prepare and interpret financial statements that report to decision makers external to the enterprise, such as shareholders and creditors. Course includes principles and standards of balance sheet valuation, income measurement, financial disclosure and cash flow analysis that link preparation and use of such statements. Pre- or co-requisites: ECON 101 and 102. Students may not receive credit for both ACCTG 211 and ACCTG 311.",
    "url": "/catalogue/course/acctg/211"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 222",
    "title": "Introduction to Accounting for Management Decision Making",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "In contrast to the external orientation of ACCTG 211, this course focuses on how to prepare and use accounting information for management decision making. Major topics include: the role of corporate goals, planning and control concepts, how costs behave and how to analyze and manage them, budgeting and performance measures. Prerequisite: ACCTG 211 or 311. Students may not receive credit for both ACCTG 222 and ACCTG 322.",
    "url": "/catalogue/course/acctg/222"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 312",
    "title": "Financial Reporting for Managers and Analysts",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Course is for students who are not accounting majors and is especially useful for those contemplating a career in financial management or a CFA designation. It is for students who want to build on the financial accounting knowledge developed in ACCTG 211, and provides the necessary foundation for courses in financial statement analysis and tax. Further depth is provided in balance sheet valuation, income measurement, earnings per share and cash flow analysis. Prerequisite: ACCTG 211 or 311. Corequisite: FIN 201 or 301. Not open to students with credit in ACCTG 314 or 414 or ACCTG 315 or 415. Students may not receive credit for both ACCTG 312 and ACCTG 412.",
    "url": "/catalogue/course/acctg/312"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 314",
    "title": "Intermediate Financial Accounting I",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "First of two courses covering principles, methods and applications of current and proposed Generally Accepted Accounting Principles (GAAP). Emphasizes accounting for operating and investment assets, and related income measurement and disclosure. Prerequisites: ACCTG 211 or 311 and ACCTG 222 or 322. Not open to students with credit in ACCTG 312 or 412. There is a consolidated exam for ACCTG 314. Students may not receive credit for both ACCTG 314 and ACCTG 414.",
    "url": "/catalogue/course/acctg/314"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 315",
    "title": "Intermediate Financial Accounting II",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Second of two courses (see ACCTG 314) covering principles, methods and applications of current and proposed Generally Accepted Accounting Principles (GAAP). Emphasizes accounting for financing, liabilities and equity, related income measurement and disclosure, and cash flow. Prerequisites: FIN 201 or 301, and a minimum grade of C- in ACCTG 314 or 414. Students may not receive credit for both ACCTG 315 and ACCTG 415.",
    "url": "/catalogue/course/acctg/315"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 324",
    "title": "Intermediate Management Accounting",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Emphasizes mastery of techniques for implementation and evaluation of cost systems for management and decision making. Cost issues include: accumulating and analyzing costs using actual, standard and activity-based approaches, overhead allocation and cost estimation. Management topics include: pricing, production and investment decisions, revenue analysis, performance evaluation, management incentive systems and strategy analysis. Linear programming and multiple regression may be used. Prerequisites: ACCTG 222 or 322 and MGTSC 212 or 312. There is a consolidated exam for ACCTG 324. Students may not receive credit for both ACCTG 324 and ACCTG 424.",
    "url": "/catalogue/course/acctg/324"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 416",
    "title": "Accounting Theory and Current Issues",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Major concepts and current issues in accounting thought are examined in an interactive setting. Topics include: the conceptual framework, standard-setting, concepts of income and value, accounting's role in capital markets and in contracts such as for lending and compensation, and recent and emerging issues related to financial and managerial accounting information. Prerequisites: ACCTG 414 or 412; FIN 301. Open only to fourth-year Business students, or by consent of the Department Chair. There is a consolidated exam for ACCTG 416.",
    "url": "/catalogue/course/acctg/416"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 418",
    "title": "Advanced Financial Accounting",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "The course analyzes the concepts and practices underlying financial reporting in more complex areas such as business combinations, multinational operations, future income taxes and not for profit organizations. Prerequisite: ACCTG 415. Open only to fourth-year Business students or by consent of the Department Chair.",
    "url": "/catalogue/course/acctg/418"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 426",
    "title": "Management Control Systems",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Current research and cases in accounting and control with a particular focus on strategy, governance and control processes in modern organizations. Topics include: control system design (including governance and audit), responsibility accounting, performance management, and strategic management accounting. Prerequisite: ACCTG 424. Open only to fourth year Business students, or by consent of Department Chair.",
    "url": "/catalogue/course/acctg/426"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 432",
    "title": "Financial Statement Analysis",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course focuses on developing student understanding of the information in financial reports and how it relates to the intrinsic values of debt and equity securities, with an emphasis on equity. Additional topics may include using financial statements to learn about a firm's operations, valuing distressed companies, evaluating statements from not-for-profit organizations, and analyzing business combinations and divestitures, depending on instructor and student interests. Course materials will typically include the main financial statements of publicly traded companies. Corequisites: ACCTG 412 or 415.",
    "url": "/catalogue/course/acctg/432"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 437",
    "title": "Accounting Information Systems",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "An introduction to the field of computerized accounting information systems in organizations: basic transaction processing, record updating and maintenance, and financial and managerial reporting functions. Concentrates on the scope of accounting information systems in organizations; impacts of computerized accounting information systems on the role of the professional accountants; design issues for accounting information systems: security, accuracy, integrity, recovery, and operational control issues relating to accounting information systems; and impacts of computerized accounting information systems on the auditing processes in organizations. Prerequisites: ACCTG 311, 322, BTM 311. Credit may be granted for only one of ACCTG 437 or BTM 437.",
    "url": "/catalogue/course/acctg/437"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 456",
    "title": "Assurance on Financial Information",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Focuses on the external auditor's provision of assurance services on financial information. Topics include: society's demand for various assurance services; the role, profession, ethics, independence and liability of the assurance provider; assurance risk and strategy; assurance planning, operations and reports; computerization and internal control; and emerging assurance services. Prerequisite: ACCTG 414 or 412.",
    "url": "/catalogue/course/acctg/456"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 463",
    "title": "Accounting for Natural Resources, Energy, and the Environment",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course covers accounting rules and practice in the area of natural resources, energy and the environment. Some topics include mineral rights and exploration costs, emissions trading, environmental reporting and liabilities. While it does contain technical material, it is meant for both accounting and non-accounting students. Both International and U.S. generally accepted accounting principles (GAAP) will be explored. The focus will be on understanding how firms in this area report their natural resource assets and related liabilities. Prerequisite: ACCTG 311. ACCTG 412 or 414 are recommended.",
    "url": "/catalogue/course/acctg/463"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 467",
    "title": "Basic Income Tax",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Examines the concepts, regulations and interpretations underlying individual and corporate income tax from the tax professional's perspective. Topics include: structure of the Income Tax Act, residency requirements, employment income, business and property income, capital gains, and the calculation of tax payable for individuals. Tax planning is introduced and opportunities for tax planning are identified where appropriate as topics are covered. Prerequisite: ACCTG 414 or 412.",
    "url": "/catalogue/course/acctg/467"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 468",
    "title": "Corporate Taxation",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "A study of the major tax concepts behind the specific provisions of the Income Tax Act in the taxation of corporations, corporate distributions and transactions between corporations and their shareholders. Emphasis on applying the Act in practical problems and case settings. Prerequisite: ACCTG 467.",
    "url": "/catalogue/course/acctg/468"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 480",
    "title": "Accounting Honors Seminar Part I",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This is primarily a case-based course that covers the preparation of integrated pro forma financial statements and their use in making financial decisions, as well as selected other topics in financial accounting. Topics will vary from year to year with case selection, and may include (but are not necessarily limited to) the areas of revenue recognition, cash flow analysis, intangible assets, asset impairment, inter-corporate investments, hybrid debt securities, leases, pensions, and equity-based compensation. While the course contains sufficient technical material to ensure familiarity with the financial reporting issues discussed, the main emphasis of the course will be on the interpretation and use of financial information for purposes of decision making. Prerequisites: ACCTG 415, FIN 301",
    "url": "/catalogue/course/acctg/480"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 481",
    "title": "Accounting Honors Seminar Part II",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course covers 3 topic areas: (1) History of accounting thought including coverage of current standard setting activities, (2) Professionalism in accounting including exposure to current practical issues requiring professional judgment, and (3) Exposure to current accounting research and design of research studies. Prerequisite: ACCTG 415.",
    "url": "/catalogue/course/acctg/481"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 488",
    "title": "Selected Topics in Accounting",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Acceptable as a Group A elective in the Major in Accounting. Normally restricted to third- and fourth-year Business students. Prerequisites: ACCTG 311, 322 or consent of Department. Additional prerequisites may be required.",
    "url": "/catalogue/course/acctg/488"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 495",
    "title": "Individual Research Project I",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Special Study for advanced undergraduates. May be considered as a Group A or Group B elective at the discretion of the Department. Prerequisites: consent of Instructor and Assistant Dean, Undergraduate Program.",
    "url": "/catalogue/course/acctg/495"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 496",
    "title": "Individual Research Project II",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Special Study for advanced undergraduates. Prerequisites: ACCTG 495, consent of the Instructor and Assistant Dean, Undergraduate Program.",
    "url": "/catalogue/course/acctg/496"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 497",
    "title": "Individual Research Project III",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Special Study for advanced undergraduates. Prerequisites: ACCTG 496, consent of the Instructor and Assistant Dean, Undergraduate Program.",
    "url": "/catalogue/course/acctg/497"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 501",
    "title": "Introduction to Financial Reporting and Analysis",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Accounting information's role in recording and reporting on economic and business events including the primary financial statements: balance sheet, income statement, and cash flow. Concepts and purposes underlying financial reporting.  Selection of accounting policies and their informational effects for external users. The course begins to develop students' abilities to evaluate and interpret financial information through basic financial analysis.",
    "url": "/catalogue/course/acctg/501"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 523",
    "title": "Accounting Information and Internal Decision Making",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Accounting concepts used by managers in planning and decision-making. The course introduces concepts of cost and profit behavior, contribution margin, and activity-based costing, as well as relevant costs and revenues for production, marketing and capital budgeting decisions. The course also introduces students to the management planning and control system and its components - budgets, variance analysis, performance evaluation in centralized and decentralized organizations, and management compensation plans. The importance of designing a system to fit the organizations' strategy is emphasized. Prerequisite: ACCTG 501.",
    "url": "/catalogue/course/acctg/523"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 601",
    "title": "Case Studies in Accounting",
    "units": {
      "credits": 5,
      "feeIndex": 9,
      "term": "EITHER, 3-0-0"
    },
    "description": "Develops students' competence in analyzing case studies in financial and managerial accounting. Topics covered include identification of financial and managerial reporting needs, preparation of financial reports, planning budgeting and forecasting, governance, and enterprise risk management. Open to students enrolled in the MAcc program only.",
    "url": "/catalogue/course/acctg/601"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 605",
    "title": "Accounting and Business Strategy",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Using a combination of theoretical frameworks and case study examples, the course is designed to provide students with the knowledge and tools necessary to assess an organization's purpose and values; formulate and evaluate an organization's strategies; translate strategies into specific business objectives and action plans; analyze the effectiveness and alignment of an organization's strategy implementation process; assess the role of the organization's corporate governance policies and processes in achieving strategic objectives, and ensure the management and governance of an organization's economic, environmental and social sustainability. Restricted to students registered in the Master of Accounting Program.",
    "url": "/catalogue/course/acctg/605"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 610",
    "title": "Financial Reporting for Managers and Analysts",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Intended for students who would like to build on the financial accounting knowledge developed in ACCTG 501, and is especially useful for those contemplating a career in financial management. Useful both as a stand-alone course and as a foundation for further study in financial statement analysis. Provides further depth in balance sheet valuation and income measurement in order to enhance students' ability to use financial accounting as a management tool. Prerequisite: ACCTG 501. Corequisite: FIN 501 or 503. Students may receive credit for only two of the following three courses: ACCTG 610, 614 and 615.",
    "url": "/catalogue/course/acctg/610"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 614",
    "title": "Intermediate Financial Accounting I",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "First of two courses covering the theory, methods, strengths, and weaknesses of current Generally Accepted Accounting Principles (GAAP). Prerequisite: ACCTG 501. Students may receive credit for only two of ACCTG 610, 614, and 615.",
    "url": "/catalogue/course/acctg/614"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 615",
    "title": "Intermediate Financial Accounting II",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Second of two courses covering theory, methods, strengths, and weaknesses of current Generally Accepted Accounting Principles (GAAP). Prerequisite: ACCTG 614. Students may receive credit for only two of the following three courses: ACCTG 610, 614, and 615.",
    "url": "/catalogue/course/acctg/615"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 616",
    "title": "Seminar in Financial Accounting Theory",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "The theory and propositions underlying current financial accounting practices and alternative theories of accounting measurement as proposed in the literature. The function of accounting in relation to the decision processes of the principal external users of accounting data is considered. Prerequisites: ACCTG 614 or 610, FIN 501 or 503.",
    "url": "/catalogue/course/acctg/616"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 618",
    "title": "Seminar in Advanced Accounting Issues",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "The application of accounting methods to incorporate investments and other advanced topics in financial reporting. Prerequisites: ACCTG 615.",
    "url": "/catalogue/course/acctg/618"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 624",
    "title": "Seminar in Management Accounting",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Seminar consisting of topics concerned at an advanced level with generating and using accounting and related data in the planning and control functions of organizations. Prerequisite: ACCTG 523.",
    "url": "/catalogue/course/acctg/624"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 625",
    "title": "Performance Management",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Addresses advanced topics in performance management including identification of organizational reporting systems to meet strategic goals, cost management, and measurement of performance on both an organizational and individual level. Open to students enrolled in the MAcc program only.",
    "url": "/catalogue/course/acctg/625"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 626",
    "title": "Seminar in Managerial Control",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Current research and cases in managerial accounting. Prerequisites: ACCTG 523.",
    "url": "/catalogue/course/acctg/626"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 630",
    "title": "Financial Statement Analysis",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Develops students' competence in analyzing financial statements and using financial information to make investment decisions, both equity and debt. The primary thrust of the course is aimed at equity investments. Students learn a five step process of analysis for equity investments: (1) An examination of the firm's industry, markets and strategy, (2) An evaluation of the firm's accounting policies and their impact on the financial reports, (3) Applying fundamental analysis to assess financial strengths and weaknesses, (4) Forecasting future earnings and cash flows, and (5) Applying valuation models to assess the current price. A comparable process for lending decisions is then developed. Prerequisite: ACCTG 501. Corequisite: FIN 501 or 503.",
    "url": "/catalogue/course/acctg/630"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 656",
    "title": "Auditing History, Theory, and Current Thought",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Focuses on the external auditor's provision of assurance services on financial information. Topics include: society's demand for various assurance services; the role, profession, ethics, independence and liability of the assurance provider; assurance risk and strategy; assurance planning, operations and reports; computerization and internal control; and emerging assurance services. Prerequisite: ACCTG 614 or 610.",
    "url": "/catalogue/course/acctg/656"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 657",
    "title": "Advanced Auditing",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Covers advanced topics in internal control/audit, external assurance engagements, audit and assurance service planning, and preparation of financial reports. Analysis of accounting policies and transactions and the role of audit committees and other corporate governance mechanisms will be discussed. Open to students enrolled in the MAcc program only.",
    "url": "/catalogue/course/acctg/657"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 662",
    "title": "Strategic Tax Planning",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "The course provides a general economic background to embed the consideration of tax provisions in organizational decision-making. The concepts learnt should be applicable and transferable to different tax regimes. Applications include showing how better decisions can be made by applying tax planning concepts and knowledge of specific tax regimes to investment decisions, compensation planning, choice of organizational form, and mergers and acquisitions. International tax planning is also covered.",
    "url": "/catalogue/course/acctg/662"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 663",
    "title": "Accounting for Natural Resources, Energy and the Environment",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course covers accounting rules and practice in the area of natural resources, energy and the environment. Some topics include mineral rights and exploration costs, emissions trading, environmental reporting and liabilities. While it does contain technical material, it is meant for both accounting and non-accounting students. Both International and U.S. generally accepted accounting principles (GAAP) will be explored. The focus will be on understanding how firms in this area report their natural resource assets and related liabilities.  Prerequisite: ACCTG 501.",
    "url": "/catalogue/course/acctg/663"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 667",
    "title": "Basic Income Tax",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Examines the concepts, regulations and interpretations underlying individual and corporate income tax from the tax professional's perspective. Topics include: structure of the Income Tax Act, residency requirements, employment income, business and property income, capital gains, and the calculation of tax payable for individuals. Tax planning is introduced and opportunities for tax planning are identified where appropriate as topics are covered. Prerequisite: ACCTG 614 or 610.",
    "url": "/catalogue/course/acctg/667"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 668",
    "title": "Corporate Taxation",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "A study of the major tax concepts behind the specific provisions of the Income Tax Act in the taxation of corporations, corporate distributions and transactions between corporations and their shareholders. Emphasis on applying the Act in practical problems and case settings. Prerequisite: ACCTG 667.",
    "url": "/catalogue/course/acctg/668"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 686",
    "title": "Selected Topics in Accounting",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Topics may vary from year to year. Students should check with the MBA Office for pre/corequisites of specific sections.",
    "url": "/catalogue/course/acctg/686"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 688",
    "title": "CPA Capstone 1",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Covers topics as required for the Capstone 1 module of the CPA Professional Education Program. Open to students enrolled in the MAcc program only.",
    "url": "/catalogue/course/acctg/688"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 689",
    "title": "CPA Capstone 2",
    "units": {
      "credits": 6,
      "feeIndex": 12,
      "term": "EITHER, 3-0-0"
    },
    "description": "Covers topics as required for the Capstone 2 module of the CPA Professional Education Program. Open to students enrolled in the MAcc program only.",
    "url": "/catalogue/course/acctg/689"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 701",
    "title": "Introduction to Accounting Research",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "A survey/history of accounting thought, introducing the major research approaches in accounting. Open to all doctoral students or with written permission of the instructor. Approval of the Associate Dean, PhD Program is also required for non-PhD students.",
    "url": "/catalogue/course/acctg/701"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 703A",
    "title": "Accounting Research Workshop",
    "units": {
      "credits": 5,
      "feeIndex": 6,
      "term": "TWO TERM, 3-0-0"
    },
    "description": "Based on the Department's research workshop program, this course will discuss research methodology as it applies to accounting and ensure students learn how to review/evaluate current research and literature. Students are expected to present their own research and to analyze the research of others. This workshop is a single term course offered over two terms. Students are expected to attend regularly throughout their doctoral program, but register for credit in their second year (prior to taking accounting comprehensive examination).",
    "url": "/catalogue/course/acctg/703a"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 703B",
    "title": "Accounting Research Workshop",
    "units": {
      "credits": 5,
      "feeIndex": 6,
      "term": "TWO TERM, 3-0-0"
    },
    "description": "Based on the Department's research workshop program, this course will discuss research methodology as it applies to accounting and ensure students learn how to review/evaluate current research and literature. Students are expected to present their own research and to analyze the research of others. This workshop is a single term course offered over two terms. Students are expected to attend regularly throughout their doctoral program, but register for credit in their second year (prior to taking accounting comprehensive examination).",
    "url": "/catalogue/course/acctg/703b"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 705",
    "title": "Individual Research",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "",
    "url": "/catalogue/course/acctg/705"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 706",
    "title": "Introduction to Behavioral and Experimental Accounting Research",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "A generalist course on research that is primarily oriented to individual behavior in accounting settings. Topics covered will include individual cognitive processes and limitations, the experimental method, and a broad survey of experimental and field studies (drawing on psychology and economics) conducted in accounting settings. Open to all doctoral students or with the written permission of the instructor. Approval of the Associate Dean, PhD Program is also required for non-PhD students.",
    "url": "/catalogue/course/acctg/706"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 707",
    "title": "Introduction to Analytical Accounting Research",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "An introductory course to familiarize students with analytical accounting research. Topics will vary depending on the instructor's area of expertise. Open to all doctoral students or with the written permission of the instructor. Approval of the Associate Dean, PhD Program is also required for non-PhD students.",
    "url": "/catalogue/course/acctg/707"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 708",
    "title": "Introduction to Empirical Accounting Research",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "An introductory course to provide students with a sound framework for understanding and appreciating empirical/archival accounting research. Topics will vary depending on the instructor's area of expertise. Open to all doctoral students or with written permission of the instructor. Approval of the Associate Dean, PhD Program is also required for non-PhD students.",
    "url": "/catalogue/course/acctg/708"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 711",
    "title": "Advanced Topics in Behavioral and Experimental Accounting Research",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course is intended to serve advanced doctoral students who have a specific interest in accounting research that uses tools from experimental psychology and/or experimental economics. Topics will vary with student interests and instructor expertise. Open to all doctoral students who have taken ACCTG 706 or the equivalent or with the written permission of the instructor. Approval of the Associate Dean, PhD Program is also required for non-PhD students.",
    "url": "/catalogue/course/acctg/711"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 732",
    "title": "Advanced Topics in Analytical Accounting Research",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course is intended to serve advanced doctoral students who have a specific interest in accounting research that uses tools from information economics or other branches of economic theory, game theory, and mathematics. Topics will vary with student interests and instructor expertise. Open to all doctoral students who have taken ACCTG 707 or the equivalent or with the written permission of the instructor. Approval of the Associate Dean, PhD Program is also required for non-PhD students.",
    "url": "/catalogue/course/acctg/732"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 733",
    "title": "Advanced Topics in Empirical Accounting Research",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course is intended to serve advanced doctoral students who have a specific interest in empirical / archival accounting research. The course will emphasize advanced research topics in empirical/archival accounting research. Open to all doctoral students who have taken ACCTG 708 or the equivalent or with the written permission of the instructor. Approval of the Associate Dean, PhD Program is also required for non-PhD students.",
    "url": "/catalogue/course/acctg/733"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 800",
    "title": "Financial Accounting",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Reporting of financial results of operations and financial positions to investors and managers; the use of accounting information for decision making. Restricted to students registered in the MBA China Program.",
    "url": "/catalogue/course/acctg/800"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 801",
    "title": "Organizational Planning and Control",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Implementing financial performance measurement, evaluation and control systems, and organizational designs that enhance performance; understanding organizational structures and processes. Restricted to students registered in the MBA China Program.",
    "url": "/catalogue/course/acctg/801"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 812",
    "title": "Financial Reporting for Managers and Analysts",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Useful both as a stand-alone course and as a foundation for further study in financial statement analysis. Provides further depth in balance sheet valuation and income measurement in order to enhance students' ability to use financial accounting as a management tool. Restricted to students registered in the MFM Program.",
    "url": "/catalogue/course/acctg/812"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 818",
    "title": "FINANCIAL STATEMENT ANALYSIS",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Develops students' competence in analyzing financial statements and using financial information to make investment decisions, both equity and debt. The primary thrust of the course is aimed at equity investments. Students learn a five step process of analysis for equity investments: (1) An examination of the firm's industry, markets and strategy, (2) An evaluation of the firm's accounting policies and their impact on the financial reports, (3) Applying fundamental analysis to assess financial strengths and weaknesses, (4) Forecasting future earnings and cash flows, and (5) Applying valuation models to assess the current price. A comparable process for lending decisions is then developed. Restricted to students registered in the MFM Program.",
    "url": "/catalogue/course/acctg/818"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 820",
    "title": "Financial Accounting",
    "units": {
      "credits": 3,
      "feeIndex": 32,
      "term": "EITHER, 3-0-0"
    },
    "description": "Reporting of financial results of operations and financial positions to investors and managers; the use of accounting information for decision making. Restricted to Executive MBA students only.",
    "url": "/catalogue/course/acctg/820"
  },
  {
    "department": "ACCTG",
    "courseCode": "ACCTG 830",
    "title": "Organization Planning and Control",
    "units": {
      "credits": 3,
      "feeIndex": 32,
      "term": "EITHER, 3-0-0"
    },
    "description": "Implementing financial performance measurement, evaluation and control systems, and organizational designs that enhance performance; understanding organizational structures and processes. Restricted to Executive MBA students only.",
    "url": "/catalogue/course/acctg/830"
  }
]