[
  {
    "department": "BIOL",
    "courseCode": "BIOL 107",
    "title": "Introduction to Cell Biology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-3"
    },
    "description": "An introduction to cell structure and function. Major topics include the molecules and structures that comprise prokaryotic and eukaryotic cells, the mechanisms by which energy is harvested and used by cells, how cells reproduce, and how information is stored and used within a cell via the processes of DNA replication, transcription, and translation. Prerequisites: Biology 30 and Chemistry 30. Note: BIOL 107 is not a prerequisite for BIOL 108. BIOL 107 and 108 can be taken in either term.",
    "url": "/catalogue/course/biol/107"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 108",
    "title": "Introduction to Biological Diversity",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-3"
    },
    "description": "Examines the major lineages of life on Earth. Overview of evolutionary principles and classification, the history of life, and the key adaptations of prokaryotes, protists, fungi, plants, and animals. Laboratories survey the diversity of biological form and function, and introduce students to data collection and scientific writing. Prerequisite: Biology 30. Note: BIOL 107 is not a prerequisite for BIOL 108. BIOL 107 and 108 can be taken in either term.",
    "url": "/catalogue/course/biol/108"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 201",
    "title": "Eukaryotic Cellular Biology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "A structural and functional dissection of a eukaryotic cell. Detection of specific molecules at the ultrastructural level; plasma membrane structure and function; cytoskeleton involvement in intracellular transport, mitosis, and cytokinesis; the endomembrane system, protein targeting, exocytosis and endocytosis; nuclear structure and function; cell cycle control and cancer. Prerequisite: BIOL 107 and a 100-level Chemistry course, or SCI 100. Note: Not to be taken by students with credit in CELL 201, in addition, not available to students currently enrolled in CELL 201.",
    "url": "/catalogue/course/biol/201"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 207",
    "title": "Molecular Genetics and Heredity",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-3"
    },
    "description": "The chromosomal and molecular basis for the transmission and function of genes. The construction of genetic and physical maps of genes and genomes. Strategies for the isolation of specific genes. Examples of regulatory mechanisms for the expression of the genetic material in both prokaryotes and eukaryotes. Prerequisite: BIOL 107 or SCI 100.",
    "url": "/catalogue/course/biol/207"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 208",
    "title": "Principles of Ecology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-3"
    },
    "description": "Ecology is the scientific study of interactions between organisms and their environment in a hierarchy of levels of organization: individuals, populations, communities, and ecosystems. Provides a comprehensive survey of general concepts that can stand alone or serve as preparation for advanced courses in ecology. Labs emphasize collection, analysis, and interpretation of data from ecological experiments and field studies to illustrate and complement lecture material. Examples are drawn from a broad range of organisms and systems. Prerequisite: BIOL 108 or SCI 100. Open to students in the BSc Forestry and BSc Forest Business Management program once they have completed REN R 120 and REN R 205.",
    "url": "/catalogue/course/biol/208"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 221",
    "title": "Mechanisms of Evolution",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 3-0-0"
    },
    "description": "Discusses the major features of the evolutionary process, including the fossil record, basic population genetics, variation, natural selection, adaptation, and speciation. Prerequisites: BIOL 107 and 108, or SCI 100. Credit cannot be obtained for both BIOL 221 and 321.",
    "url": "/catalogue/course/biol/221"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 298",
    "title": "Understanding Biological Research",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-3"
    },
    "description": "An introduction to the process of scientific research including the different approaches to research within biology, formulating research questions, hands-on skill development, experimental design, data collection and analysis, critical thinking, communication of findings, ethics, and career opportunities. Students will attend lectures and selected seminars, and participate in biological research under the supervision of an academic staff member in the Department of Biological Sciences. Open to undergraduate students in the Faculty of Science with preference given to students in Honors and Specialization Programs in the Department of Biological Sciences, and BSc General students (Biological Sciences major). Consent of Department of Biological Sciences required. All students must apply for admission. Prerequisite: BIOL 107 or 108 or SCI 100. See the Biological Sciences website for more details at www.biology.ualberta.ca/courses.",
    "url": "/catalogue/course/biol/298"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 299",
    "title": "Research Opportunity",
    "units": {
      "credits": 5,
      "feeIndex": 3,
      "term": "EITHER, 0-0-3"
    },
    "description": "A credit/no-credit course designed to give students a hands-on introduction to research under the supervision of an academic member of the Department of Biological Sciences. Recommended for students who have completed a minimum of 30 units but not more than 60 units in a program in the Faculty of Science. Prerequisites: Minimum GPA of 2.3, credit in BIOL 107 or 108 and/or consent of the Department of Biological Sciences. Credit may be obtained twice.",
    "url": "/catalogue/course/biol/299"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 310",
    "title": "Biology of Aging",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 3-0-0"
    },
    "description": "Biological aging is a complex process that involves the progressive deterioration of an organism over time. This course covers the aging process at the molecular, tissue and organismal levels. Topics for discussion include assessment of animal models of aging, mechanisms of aging, healthy aging, age-associated disease and interventions. Prerequisites: BIOL 201 or ZOOL 241 or 242. Credit cannot be obtained for both BIOL 310 and 510.",
    "url": "/catalogue/course/biol/310"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 315",
    "title": "Biology: An Historical Perspective",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 3-0-0"
    },
    "description": "An outline of the scientific foundations of biological discovery. Students must have a sophisticated understanding of modern concepts in biology, be prepared to write a major essay on a focused topic, deliver an oral presentation and participate actively in class discussion. Prerequisite: a third-year course in the biological sciences. Offered in alternate years.",
    "url": "/catalogue/course/biol/315"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 322",
    "title": "Diversity and Evolution of Microbial Life",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 3-0-0"
    },
    "description": "The diversity of microscopic life forms, both prokaryotic (bacteria and archaea) and eukaryotic (protists, fungi, phytoplankton), will be explored. The evolutionary forces responsible for this diversity will be described in detail and contrasted to those at work in macroscopic eukaryotes. Students will learn about the molecular methods used to identify and classify both culturable and non-culturable microbes, and genetically characterize entire populations. Prerequisites: BIOL 107 and 108 or SCI 100, and a 200-level Biological Sciences course. MICRB 265 recommended.",
    "url": "/catalogue/course/biol/322"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 330",
    "title": "Introduction to Biological Data",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 3-0-3"
    },
    "description": "Expands on prior introductions to the scientific method and examines the steps involved in the planning, collection, organization, analysis and presentation of biological data. Classes will explore the types of data used to answer a variety of biological questions and will review several different sampling designs, assess the benefits and limitations of various data types for scientific inference, and integrate the statistical methods that are common to other introductory courses.  Labs will teach students how spreadsheets and relational databases can be used to manipulate, analyze, and present the results of scientific research. Prerequisites: BIOL 208 and STAT 151 or SCI 151.",
    "url": "/catalogue/course/biol/330"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 332",
    "title": "Community Ecology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-3S-0"
    },
    "description": "Principles of community ecology, applied to plants and animals. The nature of communities, functional groups and rarity; niche theory and competition; disturbance and other alternatives to competition; food webs (predation, herbivory and disease); diversity (determinants, functional consequences and gradients); island communities. Prerequisites: BIOL 208; STAT 151 or SCI 151; and any one of MATH 113, 114, 115, 120, 125 or SCI 100. May not be taken for credit if credit already obtained in ZOOL 332.",
    "url": "/catalogue/course/biol/332"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 333",
    "title": "Wetland Science and Management",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 3-0-3"
    },
    "description": "The course includes an introduction to the hydrology, biogeochemistry and ecology of wetland ecosystems. Topics covered include classification, geomorphic setting, distribution, functions and ecosystem services of wetlands. Human use, alteration and management of wetlands are examined. An emphasis is placed on wetlands and wetland management in Western Canada, including boreal peatlands and prairie marshes. A full day field trip on a Saturday is required. Prerequisite: one of BIOL 208, REN R 250, or EAS 201. Credit may be obtained in only one of BIOL 333 and REN R 333. This course requires payment of additional student instructional support fees. Refer to the Tuition and Fees page in the University Regulations section of the Calendar.",
    "url": "/catalogue/course/biol/333"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 335",
    "title": "Principles of Systematics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 3-1S-0"
    },
    "description": "An introduction to the principles, methods, and applications of biological systematics, including reconstruction of phylogenies, creation of classifications, historical biogeography, and applications in evolutionary biology. Each student will analyze phylogenetic data and write a description of a species and its relationships. Prerequisite: BIOL 108 or SCI 100 and a 200-level Biological Sciences course; BIOL 221 strongly recommended.",
    "url": "/catalogue/course/biol/335"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 341",
    "title": "Ecotoxicology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "An overview of the adverse effects of chemicals or physical agents on biological systems in an ecological context. This course takes a multidisciplinary approach to understanding biological effects and their assessment. Prerequisites: BIOL 208; ZOOL 241 or PHYSL 210 or 212 or 214; and CHEM 261.",
    "url": "/catalogue/course/biol/341"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 343",
    "title": "Techniques for Macromolecular Characterization",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 0-0-6"
    },
    "description": "Critical discussion and use of techniques for characterizing macromolecules from prokaryotic and eukaryotic systems. This course provides the theoretical and hands-on experience required to use classic and cutting-edge technologies to characterize the properties of these macromolecules. Prerequisite: BIOL 207, BIOL 391, and BIOCH 200, or consent of Department. Credit can only be obtained for one of BIOL 343 or 543 or MICRB 343 or 345.",
    "url": "/catalogue/course/biol/343"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 361",
    "title": "Marine Science",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 3-0-0"
    },
    "description": "An introduction to marine science and marine biology including history of marine exploration, essential features of the physical marine environment, a survey of major marine communities and adaptations of the organisms that live in each, overviews of selected groups of marine organisms (e.g., marine mammals), and human impact on the oceans. Recommended as preparation for courses offered through the Bamfield Marine Station (see courses listed under MA SC). Prerequisite: ZOOL 250 or BIOL 208.",
    "url": "/catalogue/course/biol/361"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 364",
    "title": "Freshwater Ecology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 3-1S-0"
    },
    "description": "An introduction to the ecology of freshwater ecosystems. Lectures will examine the roles of biota in ecological patterns and processes in lakes, ponds, rivers, and streams, emphasizing north-temperate and boreal regions. Seminars will focus on recent papers from the primary literature. Designed to stand-alone or to provide a biological complement to BIOL 464. Prerequisite: BIOL 208.",
    "url": "/catalogue/course/biol/364"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 365",
    "title": "Methods in Freshwater Ecology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 1-0-3"
    },
    "description": "A practical course introducing students to techniques used in the field and lab to biomonitor lakes and streams. Topics covered will include plankton production and composition, fish and benthos community structure, herbivory and predation, and paleolimnology. The laboratory component includes field trips and independent research projects.  Pre or corequisite: BIOL 364 or permission of instructor.",
    "url": "/catalogue/course/biol/365"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 366",
    "title": "Northern Ecology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 3-0-0"
    },
    "description": "Examines the ecology of boreal and arctic ecosystems, including postglacial history, climate, geology, nutrient cycling and energy flow in forests, wetlands, lakes and marine systems, animal and plant adaptations to cold and current human impacts. Prerequisite: BIOL 208. Credit cannot be obtained for BIOL 366 and any of the following courses: REN R 365, 463, 466.",
    "url": "/catalogue/course/biol/366"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 367",
    "title": "Conservation Biology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 3-0-0"
    },
    "description": "This course introduces the principles of conservation biology with an emphasis on ecological processes operating at population, community and ecosystem levels of organization. Threats to biological diversity, ranging from species introductions to habitat destruction will be discussed along with conservation solutions ranging from the design of protected areas through conservation legislation. Prerequisite: BIOL 208. Credit cannot be obtained in both BIOL 367 and REN R 364.",
    "url": "/catalogue/course/biol/367"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 380",
    "title": "Genetic Analysis of Populations",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 3-1S-0"
    },
    "description": "Application of molecular biology to the study of systematics, structure of natural populations, mating systems, and forensics. Among the topics discussed are molecular techniques used to detect genetic variation in natural populations, methods to construct phylogenies using molecular data, mathematical models of population structure, paternity analysis, and DNA fingerprinting. Prerequisite: BIOL 207. BIOL 221 recommended.",
    "url": "/catalogue/course/biol/380"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 381",
    "title": "A Planet in Crisis",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 3-0-0"
    },
    "description": "This course examines how humankind's collective activities, including altering the climate, have significantly affected the natural planetary balance. We will discuss human population growth and unsustainable resource use; the movement of pollutants through the atmosphere, hydrosphere and biosphere; the impacts these stressors have on ecosystem services and human health; and how certain impacts have been and can be mitigated by environmental policies and laws. Prerequisite: BIOL 208.",
    "url": "/catalogue/course/biol/381"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 384",
    "title": "Global Change and Ecosystems",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 3-0-0"
    },
    "description": "Ecological impacts of climate change and large-scale human activities on terrestrial and aquatic ecosystems. The focus of this course is to learn to write brief technical summaries of current environment issues, in a fashion that can be understood by an educated citizen. Topics such as climate change, water management projects, invasion of exotic species and national parks management are presented as the forum to evaluate options, trade-offs and solutions to environmental social issues. Prerequisites: BIOL 208; BOT 205 recommended.",
    "url": "/catalogue/course/biol/384"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 390",
    "title": "Literature Review Project",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-0-6"
    },
    "description": "A review of the scientific literature on a biological topic, done under the supervision of an academic member of the Department of Biological Sciences. A co-supervisor, who may be outside the Department, may be involved at the supervisor's discretion. Completion of this course requires a written report on the information gleaned from the literature. Prerequisites: A 200-level Biological Sciences course, and consent of Department.",
    "url": "/catalogue/course/biol/390"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 391",
    "title": "Techniques in Molecular Biology and Bioinformatics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-1S-6"
    },
    "description": "A laboratory course introducing students to techniques in gene manipulation, protein expression and bioinformatics by following a gene through a thematic series of molecular manipulations. Prerequisites: BIOL 207 and BIOCH 200 or consent of Department. Not to be taken by students currently enrolled in GENET 420 or with credit in GENET 420. Credit can be obtained for only one of BIOL 391, IMIN 391 or MMI 391.",
    "url": "/catalogue/course/biol/391"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 392",
    "title": "Laboratory Techniques in Molecular Ecology and Systematics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 0-1S-6"
    },
    "description": "A laboratory course introducing students to current molecular biology techniques and associated analyses used to study population genetics, systematics, and evolutionary biology in natural populations. Students will develop microsatellite marker systems and use them to examine the genetic structure of a natural population. A comparative bioinformatic approach will be used to generate sequence data to investigate the use of single nucleotide polymorphisms in candidate gene analysis and in phylogenetic inference. Prerequisite: BIOL 207 and BIOL 208. Corequisite: BIOL 380. Note: BIOL 392 and 592 cannot both be taken for credit.",
    "url": "/catalogue/course/biol/392"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 395",
    "title": "Field Course in Biology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, VARIABLE"
    },
    "description": "Covers special topics of current interest in biology pertaining specifically to field opportunities. This course may be held outside of Edmonton at one or more off-campus locations either domestically or internationally, and may require additional on-campus coursework. This course requires payment of additional miscellaneous fees. Refer to the Tuition and Fees page in the University Regulations section of the Calendar. See departmental website for BIOL 395 offered sections. Prerequisite: second year Biological Sciences course and permission of instructor. Credit for this course may be obtained more than once.",
    "url": "/catalogue/course/biol/395"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 398",
    "title": "Research Project",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-0-6"
    },
    "description": "Directed research done under the supervision of an academic member of the Department of Biological Sciences. Normally for students in their third year of study. Successful completion of this course requires a written report on the research project. Prerequisites: A 200-level Biological Sciences course and consent of the Associate Chair, Undergraduate Studies. Credit for this course may be obtained only once.",
    "url": "/catalogue/course/biol/398"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 399A",
    "title": "Research Project",
    "units": {
      "credits": 3,
      "feeIndex": 12,
      "term": "TWO TERM, 0-0-6"
    },
    "description": "Directed research done under the supervision of an academic member of the Department of Biological Sciences. Normally for students in their third year of study. Successful completion of this course requires a written report on the research project. Prerequisites: A 200-level Biological Sciences course and consent of the Associate Chair, Undergraduate Studies. Credit for this course may be obtained only once.",
    "url": "/catalogue/course/biol/399a"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 399B",
    "title": "Research Project",
    "units": {
      "credits": 3,
      "feeIndex": 12,
      "term": "TWO TERM, 0-0-6"
    },
    "description": "Directed research done under the supervision of an academic member of the Department of Biological Sciences. Normally for students in their third year of study. Successful completion of this course requires a written report on the research project. Prerequisites: A 200-level Biological Sciences course and consent of the Associate Chair, Undergraduate Studies. Credit for this course may be obtained only once.",
    "url": "/catalogue/course/biol/399b"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 408",
    "title": "Foundations of Ecology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 0-3S-0"
    },
    "description": "This course will use a combination of approaches to evaluate the origins and modern usage of foundational ideas and studies in ecology. Topics may include diversity gradients, niche theory, life-histories & strategies, multi-trophic networks and ecological stability. Prerequisites: BIOL 208 and 6 units from Ecology, Evolution and Environmental Biology List C. Credit cannot be obtained for both BIOL 408 and BIOL 508.",
    "url": "/catalogue/course/biol/408"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 409",
    "title": "Zoonoses",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 3-0-0"
    },
    "description": "This course will examine the biology of zoonotic agents and the implication of host-pathogen interactions to disease susceptibility and resistance. Students will apply these basic concepts towards the understanding of issues governing pathogenesis, pathology, epidemiology, control and surveillance of zoonotic diseases. Focus will be placed on zoonotic agents currently having a significant impact on animal and public health. Lectures will be followed by active discussion of selected readings. Prerequisites: one of IMIN 200, ZOOL 352, ZOOL 354, or ENT 392. Credit cannot be obtained for both BIOL 409 and BIOL 509.",
    "url": "/catalogue/course/biol/409"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 411",
    "title": "Ecological and Evolutionary Genomics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 0-3S-0"
    },
    "description": "This course surveys the application of genomic approaches to problems of ecology and organismal evolution. It combines explanation of methodological and conceptual approaches with presentation and discussion of case studies. Topics include adaptation, speciation, genome evolution, metagenomics, population genomics, and functional genomics. Prerequisites: BIOL 207, 208, and 221. Credit cannot be obtained for both BIOL 411 and BIOL 511.",
    "url": "/catalogue/course/biol/411"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 421",
    "title": "Molecular Evolution and Systematics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-3"
    },
    "description": "Methods for inferring evolutionary trees and their applications to the fields of comparative biology, molecular evolution, and systematics. Topics to be covered include phylogenetic inference, molecular evolution integrated at the organismal and population level, and evolutionary developmental genetics. Labs emphasize practical experience in data analysis. Prerequisite: BIOL 335 or consent of Department. BIOL 380 or 392 recommended. Credit cannot be obtained for both BIOL 421 and BIOL 521. Offered in alternate years.",
    "url": "/catalogue/course/biol/421"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 430",
    "title": "Statistical Design and Analysis in Biology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-3"
    },
    "description": "Emphasis is on the design of experiments and analysis of data collected from field and laboratory studies in Biology. Prerequisites: STAT 151 or 161 or SCI 151, BIOL 330, and an additional 300-level Biological Sciences course; or consent of Department. Credit can be obtained in only one of BIOL 430, 530 and REN R 480.",
    "url": "/catalogue/course/biol/430"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 431",
    "title": "Population Ecology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 3-0-3"
    },
    "description": "Principles of population ecology as they apply to plants and animals; population consequences of variation among individuals; habitat structure and population structure; habitat selection and foraging theory; life tables, demography, and the evolution of life history patterns; population dynamics; interactions among organisms (predation, competition, mutualism, parasites/disease); harvesting; and population regulation. Prerequisites: BIOL 208; BIOL 330; one of MATH 114, 125, 134, 144, or 154; STAT 151 or 161.",
    "url": "/catalogue/course/biol/431"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 432",
    "title": "Field Methods in Ecology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 0-0-6"
    },
    "description": "Design, execution, analysis, and presentation of problems in behavioral, population, and community ecology in a field environment. Field exercises, demonstration of techniques, and data collection for independent projects will take place during the two weeks preceding the Fall term at a field station off the main campus. Final reports are due in the last week of September. Prerequisites: BIOL 331 or 332 or ZOOL 371 or BOT 332; a statistics course such as STAT 151 or SCI 151, BIOL 330 or 430. This course requires payment of additional miscellaneous fees. Refer to the Tuition and Fees page in the University Regulations section of the Calendar.",
    "url": "/catalogue/course/biol/432"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 433",
    "title": "Plant Animal Interactions",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Plants and animals are engaged in a diversity of ecological interactions, with implications for evolutionary trajectories, species coexistence, and the delivery of ecosystem services. This course requires active engagement, which may include discussion and debate. Lecture content will include a diversity of advanced topics in ecology and evolutionary biology with a focus on species interactions. Prerequisite: BIOL 331 or 332 or BOT 332 or ZOOL 371.",
    "url": "/catalogue/course/biol/433"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 434",
    "title": "Chemical Ecology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "An introduction to the broad field of Chemical Ecology through survey, discussion and analysis of current and historical literature. Topics include a wide array of chemically-mediated ecological interactions in a variety of taxa. Studies that analyze the importance of the use of chemical signals for habitat selection, resource acquisition, reproduction, defense and social interactions are discussed. Students research topics in Chemical Ecology and present their findings in oral and written formats. Prerequisite: BIOL 208. CHEM 164 or 261 recommended. Credit cannot be obtained for both BIOL 434 and 534. Offered in alternate years.",
    "url": "/catalogue/course/biol/434"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 440",
    "title": "Watershed Ecohydrology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 0-3S-0"
    },
    "description": "The course will introduce students to theory and techniques employed in the analysis of physical, hydrological, chemical, and ecological properties of ecosystems using a watershed (catchment) approach. Focus will be on landscape interactions or linkages between upland, wetland/riparian, and surface-water in the study of the natural ecohydrologic function and response to disturbance of watershed ecosystems. Emphasis will be placed on Boreal Alberta. Topics are covered through reading the literature and group discussions. Prerequisite: One of BIOL 333, 340, 364, EAS 223, REN R 350, or consent of the Department. Credit cannot be obtained for both BIOL 440 and 540.",
    "url": "/catalogue/course/biol/440"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 442",
    "title": "Global Biogeochemical Cycles",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 0-3S-0"
    },
    "description": "This course explores the intersecting biological, chemical, and geological processes and reactions governing the cycling of elements that control our environment. Course discussions will include consideration of the atmosphere, lithosphere, hydrosphere and biosphere, and will be framed by our understanding that elemental cycling on Earth is fundamentally altered by organisms. Coursework will incorporate current topics in anthropogenic alteration of the natural cycles critical for organismal and planetary function. Prerequisites: CHEM 101 and BIOL 208. Credit cannot be obtained for both BIOL 442 and 542.",
    "url": "/catalogue/course/biol/442"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 445",
    "title": "Current Topics in Animal and Cell Physiology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 0-3S-0"
    },
    "description": "Survey, discussion and evaluation of literature dealing with current advances and selected topics in animal and cell physiology. Prerequisite: ZOOL 340 or 342 or 343, or PHYSL 372 and consent of instructor. Credit may be obtained more than once. Offered in alternate years.",
    "url": "/catalogue/course/biol/445"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 468",
    "title": "Topics in Conservation Biology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 0-3S-0"
    },
    "description": "Seminar and reading course addressing current topics in conservation biology. Prerequisites: BIOL 367 or REN R 364 or consent of instructor.",
    "url": "/catalogue/course/biol/468"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 471",
    "title": "Landscape Ecology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 3-0-3"
    },
    "description": "Landscapes are holistic entities whose patterns influence ecological processes. Topics highlighted in this course include landscape components, morphology and dynamics; detecting spatial/temporal change in landscapes; issues of scales; movements of organisms, disturbances, and nutrients across landscape mosaics; and restoration, planning and management in a landscape context. Labs emphasize GIS applications to characterizing landscape patterns and heterogeneity in space and time, distributing and moving organisms across landscapes, and restoring or planning landscapes for conservation objectives. Prerequisites: MATH 115 or SCI 100; STAT 151 or SCI 151; one of BIOL 331, 332 or BOT 332. Previous GIS course is useful. Credit cannot be obtained for both BIOL 471 and 571.",
    "url": "/catalogue/course/biol/471"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 490",
    "title": "Individual Study",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-0-6"
    },
    "description": "Registration will be contingent on the student's having made prior arrangements with a faculty member willing to supervise the program. Credit may be obtained more than once. Prerequisites: A 300-level Biological Sciences course and consent of the Associate Chair, Undergraduate Studies.",
    "url": "/catalogue/course/biol/490"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 495",
    "title": "Special Topics in Biology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "Covers specialized topics of current interest to advanced undergraduates in Biological Sciences. Consult the Department for details about current offerings. Prerequisite: consent of instructor. Credit for this course may be obtained more than once.",
    "url": "/catalogue/course/biol/495"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 496",
    "title": "Special Topics in Biology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-3"
    },
    "description": "Covers specialized topics of current interest to advanced undergraduates in Biological Sciences. Consult the Department for details about current offerings. Prerequisite: consent of instructor. Credit for this course may be obtained more than once.",
    "url": "/catalogue/course/biol/496"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 497",
    "title": "Special Topics in Biology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-1S-6"
    },
    "description": "Covers specialized topics of current interest to advanced undergraduates in Biological Sciences. Consult the Department for details about current offerings. Prerequisite: consent of instructor. Credit for this course may be obtained more than once.",
    "url": "/catalogue/course/biol/497"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 498",
    "title": "Research Project",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-0-6"
    },
    "description": "Directed research done under the supervision of an academic member of the Department of Biological Sciences. Normally for students in their fourth year of study. Successful completion of this course requires a written report on the research project. Credit may be obtained more than once. Prerequisites: A 300-level Biological Sciences course and consent of the Associate Chair, Undergraduate Studies.",
    "url": "/catalogue/course/biol/498"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 499A",
    "title": "Research Project",
    "units": {
      "credits": 3,
      "feeIndex": 12,
      "term": "TWO TERM, 0-0-6"
    },
    "description": "Directed research done under the supervision of an academic member of the Department of Biological Sciences. Normally for students in their fourth year of study. Successful completion of this course requires an oral presentation and a written report on the research project. Prerequisites: A 300-level Biological Sciences course and the consent of the Associate Chair, Undergraduate Studies. Note: Students in Honors in Biological Sciences are required to successfully complete BIOL 499.",
    "url": "/catalogue/course/biol/499a"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 499B",
    "title": "Research Project",
    "units": {
      "credits": 3,
      "feeIndex": 12,
      "term": "TWO TERM, 0-0-6"
    },
    "description": "Directed research done under the supervision of an academic member of the Department of Biological Sciences. Normally for students in their fourth year of study. Successful completion of this course requires an oral presentation and a written report on the research project. Prerequisites: A 300-level Biological Sciences course and the consent of the Associate Chair, Undergraduate Studies. Note: Students in Honors in Biological Sciences are required to successfully complete BIOL 499.",
    "url": "/catalogue/course/biol/499b"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 501",
    "title": "Applied Bioinformatics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 3-1S-0"
    },
    "description": "Discussion of computational tools and databases used in the analysis of data from high-throughput molecular biology studies. Students will use existing tools, learn the underlying algorithms and their limitations, and will be required to complete an individual research project. Prerequisite: consent of instructor. Credit cannot be obtained for both BIOIN 301 and BIOL 501.",
    "url": "/catalogue/course/biol/501"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 506",
    "title": "Systematics and Evolution Forum",
    "units": {
      "credits": 2,
      "feeIndex": 4,
      "term": "EITHER, 1-1S-0"
    },
    "description": "Lectures and discussions on a variety of subjects in systematics and evolutionary biology by graduate students, staff, and visiting speakers. Credit may be obtained more than once. Prerequisite: consent of instructors for students not registered in the systematics and evolution graduate program.",
    "url": "/catalogue/course/biol/506"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 508",
    "title": "Foundations of Ecology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 0-3S-0"
    },
    "description": "This course will use a combination of approaches to evaluate the origins and modern usage of foundational ideas and studies in ecology. Topics may include diversity gradients, niche theory, life-histories & strategies, multi-trophic networks and ecological stability. Seminars are the same as for BIOL 408 but with additional assignments and evaluations appropriate for graduate studies. Prerequisite: Consent of Department. Credit cannot be obtained for both BIOL 408 and BIOL 508.",
    "url": "/catalogue/course/biol/508"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 509",
    "title": "Advanced Topics in Zoonoses",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 3-0-0"
    },
    "description": "This course will examine the biology of zoonotic agents and the implication of host-pathogen interactions to disease susceptibility and resistance. Students will apply these basic concepts towards the understanding of issues governing pathogenesis, pathology, epidemiology, control and surveillance of zoonotic diseases. Focus will be placed on zoonotic agents currently having a significant impact on animal and public health. Lectures will be followed by active discussion of selected readings. Scheduled classes are the same as for BIOL 409, but with additional assignments and evaluation appropriate to graduate studies. Prerequisite: consent of instructor. Credit cannot be obtained for both BIOL 409 and BIOL 509.",
    "url": "/catalogue/course/biol/509"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 510",
    "title": "Advanced Biology of Aging",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 3-0-0"
    },
    "description": "Biological aging is a complex process that involves the progressive deterioration of an organism over time. This course covers the aging process at the molecular, tissue and organismal levels. Topics for discussion include assessment of animal models of aging, mechanisms of aging, healthy aging, age-associated disease and interventions. Lectures are the same as BIOL 310, but with additional assignments and evaluation appropriate to graduate studies. Prerequisite: Consent of instructor. Credit cannot be obtained for both BIOL 310 and BIOL 510.",
    "url": "/catalogue/course/biol/510"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 511",
    "title": "Ecological and Evolutionary Genomics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 0-3S-0"
    },
    "description": "This course surveys the application of genomic approaches to problems of ecology and organismal evolution. It combines the explanation of methodological and conceptual approaches with presentation and discussion of case studies. Topics include adaptation, speciation, genome evolution, metagenomics, population genomics, and functional genomics. Seminars are the same as for BIOL 411 but with additional assignments and evaluations appropriate for graduate studies. Prerequisites: Consent of Department. Credit cannot be obtained for both BIOL 411 and BIOL 511.",
    "url": "/catalogue/course/biol/511"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 514",
    "title": "Advanced Molecular and Cellular Biology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 3-0-0"
    },
    "description": "Students will use their own thesis research area of molecular and cellular biology for writing for different readers, and for visualizing data in various ways to emphasize critical concepts or facts. They will perform peer review of selected assignments. Students will present a final summary of their assignments to the class. Credit may not be obtained for both BIOL 514 and BIOL 603.",
    "url": "/catalogue/course/biol/514"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 521",
    "title": "Advanced Molecular Evolution and Systematics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-3"
    },
    "description": "Methods for inferring evolutionary trees and their applications to the fields of comparative biology, molecular evolution, and systematics. Topics to be covered include phylogenetic inference, molecular evolution integrated at the organismal and population level, and evolutionary developmental genetics. Labs emphasize practical experience in data analysis. Lectures and labs are the same as BIOL 421, but with additional assignments and evaluation appropriate to graduate studies. Prerequisite: Consent of instructor. Credit cannot be obtained for both BIOL 421 and BIOL 521. Offered in alternate years.",
    "url": "/catalogue/course/biol/521"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 530",
    "title": "Advanced Statistical Design and Analysis in Biology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-3"
    },
    "description": "Emphasis is on the design of experiments and analysis of data collected from field and laboratory studies in Biology.  Lectures and labs are the same as BIOL 430, but with additional assignments and evaluations appropriate to graduate studies.  Prerequisite: consent of instructor. Credit cannot be obtained for BIOL 430, 530 and REN R 480.",
    "url": "/catalogue/course/biol/530"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 531",
    "title": "Advanced Population Ecology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 3-0-3"
    },
    "description": "Principles of population ecology as they apply to plants and animals; population consequences of variation among individuals; habitat structure and population structure; habitat selection and foraging theory; life tables, demography, life history patterns; population dynamics; interactions among organisms (predation, competition, mutualism, parasites/disease); harvesting; and population regulation. Highly quantitative content. Prerequisites: BIOL 208, 330; any one of MATH 113, 114, 115, 120, 125 or SCI 100; STAT 151 or SCI 151. Graduate students are evaluated with assessments appropriate to graduate studies.Credit may not be obtained for both BIOL 431 and BIOL 531.",
    "url": "/catalogue/course/biol/531"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 534",
    "title": "Advanced Chemical Ecology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "An introduction to the broad field of Chemical Ecology through survey, discussion and analysis of current and historical literature. Topics include a wide array of chemically-mediated ecological interactions in a variety of taxa. Studies that analyze the importance of the use of chemical signals for habitat selection, resource acquisition, reproduction, defense and social interactions are discussed. Students research topics in Chemical Ecology and present their findings in oral and written formats. Graduate students complete an additional assignment and evaluation appropriate to graduate studies. Prerequisite: consent of instructor. Credit cannot be obtained for both BIOL 434 and 534. Offered in alternate years.",
    "url": "/catalogue/course/biol/534"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 540",
    "title": "Advanced Watershed Ecohydrology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 0-3S-0"
    },
    "description": "The course will introduce students to theory and techniques employed in the analysis of physical, hydrological, chemical, and ecological properties of ecosystems using a watershed (catchment) approach. Focus will be on landscape approaches relating interactions or linkages between upland, wetland/riparian, and surface-water in the study of the natural ecohydrologic function and response to disturbance of watershed ecosystems. Emphasis will be placed on Boreal Alberta. Topics are covered through reading the literature and group discussions. Seminars are the same as for BIOL 440, but with additional assignments and evaluation appropriate to graduate studies. Prerequisite: consent of instructor. Credit cannot be obtained for both BIOL 440 and 540.",
    "url": "/catalogue/course/biol/540"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 542",
    "title": "Advanced Global Biogeochemical Cycles",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "This course explores the intersecting biological, chemical, and geological processes and reactions governing the cycling of elements that control our environment. Course discussions will include consideration of the atmosphere, lithosphere, hydrosphere and biosphere, and will be framed by our understanding that elemental cycling on Earth is fundamentally altered by organisms. Coursework will incorporate current topics in anthropogenic alteration of the natural cycles critical for organismal and planetary function. Seminars are the same as for BIOL 442, but with additional assignments and evaluation appropriate to graduate studies. Prerequisite: consent of Instructor. Credit cannot be obtained for both BIOL 442 and 542.",
    "url": "/catalogue/course/biol/542"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 543",
    "title": "Advanced Techniques for Macromolecular Characterization",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 0-0-6"
    },
    "description": "Critical discussion and use of techniques for characterizing macromolecules from prokaryotic and eukaryotic systems. This course provides the theoretical and hands-on experience required to use classic and cutting-edge technologies to characterize the properties of these macromolecules. Prerequisite: consent of instructor. Lectures, assignments and exams are the same as BIOL 343 with additional assignments and evaluation appropriate to graduate studies. Credit can only be obtained for one of BIOL 343 or 543 or MICRB 343 or 345.",
    "url": "/catalogue/course/biol/543"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 545",
    "title": "Advanced Topics in Animal and Cell Physiology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 0-3S-0"
    },
    "description": "Survey, discussion and evaluation of literature dealing with current advances and selected topics in animal and cell physiology. Credit may be obtained more than once. Discussions are the same as for BIOL 445, but with additional assignments and evaluation appropriate to graduate studies. Enrolment of students by consent of instructor. Offered in alternate years.",
    "url": "/catalogue/course/biol/545"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 560",
    "title": "Current Problems in Ecology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "Seminar and reading on current problems concerning selected aspects of ecology. More than one section may be available and topics change from year to year. Please consult the Department for current information. Credit for this course may be obtained more than once. Prerequisite: at least one 400-level ecology course.",
    "url": "/catalogue/course/biol/560"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 570",
    "title": "Models in Ecology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 0-3S-1"
    },
    "description": "Formulation, analysis, parameterization, and validation of quantitative models for ecological processes.  Applications include population dynamics, species interactions, movement, and spatial processes.  Approaches include classical hypothesis testing, computer simulation, differential equations, individual-based models, least squares, likelihood, matrix equations, Markov processes, multiple working hypotheses, and stochastic processes. The lab covers computer simulation methods.  Prerequisite:  consent of Instructor. Offered in alternate years.",
    "url": "/catalogue/course/biol/570"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 571",
    "title": "Landscape Ecology and Applications",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 3-0-3"
    },
    "description": "Landscapes are holistic entities whose patterns influence ecological processes. Topics highlighted in this course include landscape components, morphology and dynamics; detecting spatial/temporal change in landscapes; issues of scales; movements of organisms, disturbances, and nutrients across landscape mosaics; and restoration, planning and management in a landscape context. Labs emphasize GIS applications to characterizing landscape patterns and heterogeneity in space and time, distributing and moving organisms across landscapes, and restoring or planning landscapes for conservation objectives. Lectures and labs are the same as for BIOL 471, but with an additional research project and evaluation appropriate to graduate studies. Prerequisite: consent of instructor. Credit cannot be obtained for both BIOL 471 and 571.",
    "url": "/catalogue/course/biol/571"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 592",
    "title": "Laboratory Techniques in Molecular Ecology and Systematics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 0-1S-6"
    },
    "description": "A laboratory course introducing students to current molecular biology techniques and associated analyses used to study population genetics, systematics, and evolutionary biology in natural populations. Students will develop microsatellite marker systems and use them to examine the genetic structure of a natural population. A comparative bioinformatic approach will be used to generate sequence data to investigate the use of single nucleotide polymorphisms in candidate gene analysis and in phylogenetic inference. Labs are the same as BIOL 392, but with additional assignments and evaluation appropriate to graduate studies. Prerequisite: consent of instructor, corequisite: BIOL 380. Credit cannot be obtained for both BIOL 392 and 592.",
    "url": "/catalogue/course/biol/592"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 595",
    "title": "Special Topics in Biology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "Covers specialized topics of current interest to graduate students in Biological Sciences. Consult the Department for details about current offerings. Prerequisite: consent of instructor. Credit for this course may be obtained more than once.",
    "url": "/catalogue/course/biol/595"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 596",
    "title": "Special Topics in Biology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-3"
    },
    "description": "Covers specialized topics of current interest to graduate students in Biological Sciences. Consult the Department for details about current offerings. Prerequisite: consent of instructor. Credit for this course may be obtained more than once.",
    "url": "/catalogue/course/biol/596"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 597",
    "title": "Special Topics in Biology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-1S-6"
    },
    "description": "Covers specialized topics of current interest to graduate students in Biological Sciences. Consult the Department for details about current offerings. Prerequisite: consent of instructor. Credit for this course may be obtained more than once.",
    "url": "/catalogue/course/biol/597"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 603",
    "title": "Advanced Ecology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "Designed for new graduate students in environmental biology to foster critical thinking and discussion and to introduce them to issues of experimental design and analysis and different approaches to ecology. The course involves student discussion of papers, lectures by faculty members on their research, seminars by students and a written assignment. Prerequisite: consent of instructor. Preference will be given to students in Biological Sciences.",
    "url": "/catalogue/course/biol/603"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 631",
    "title": "Seminar in Ecology and Evolution",
    "units": {
      "credits": null,
      "feeIndex": null,
      "term": null
    },
    "description": "Credit may be obtained more than once.",
    "url": "/catalogue/course/biol/631"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 633",
    "title": "Advanced Techniques in Biology",
    "units": {
      "credits": null,
      "feeIndex": null,
      "term": null
    },
    "description": "This course will cover specialized topics of current interest to graduate students in Biological Sciences with an emphasis on learning new research skills. Prerequisite: consent of Instructor. Credit for this course may be obtained more than once.",
    "url": "/catalogue/course/biol/633"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 642",
    "title": "Seminars in Physiology, Cell and Developmental Biology",
    "units": {
      "credits": null,
      "feeIndex": null,
      "term": null
    },
    "description": "Credit may be obtained more than once.",
    "url": "/catalogue/course/biol/642"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 698",
    "title": "Undergraduate Research Mentoring",
    "units": {
      "credits": null,
      "feeIndex": null,
      "term": null
    },
    "description": "A credit/no-credit course for graduate students who are mentoring undergraduates in a research course (BIOL 398, 490 and 498) under the supervision of an academic member of the Department of Biological Sciences. Mentorship includes activities such as in lab or field supervision, training, and help with reports and presentations. Consent of Department of Biological Sciences required. Can be taken in any year. Credit may be obtained more than once.",
    "url": "/catalogue/course/biol/698"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 699A",
    "title": "Undergraduate Research Mentoring",
    "units": {
      "credits": null,
      "feeIndex": null,
      "term": null
    },
    "description": "A credit/no-credit course for graduate students who are mentoring undergraduates in a research course (BIOL 399 and 499) under the supervision of an academic member of the Department of Biological Sciences. Mentorship includes activities such as in lab or field supervision, training, and help with reports and presentations. Consent of Department of Biological Sciences required. Can be taken in any year. Credit may be obtained more than once.",
    "url": "/catalogue/course/biol/699a"
  },
  {
    "department": "BIOL",
    "courseCode": "BIOL 699B",
    "title": "Undergraduate Research Mentoring",
    "units": {
      "credits": null,
      "feeIndex": null,
      "term": null
    },
    "description": "A credit/no-credit course for graduate students who are mentoring undergraduates in a research course (BIOL 399 and 499) under the supervision of an academic member of the Department of Biological Sciences. Mentorship includes activities such as in lab or field supervision, training, and help with reports and presentations. Consent of Department of Biological Sciences required. Can be taken in any year. Credit may be obtained more than once.",
    "url": "/catalogue/course/biol/699b"
  }
]