[
  {
    "department": "BTM",
    "courseCode": "BTM 211",
    "title": "Management Information Systems",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-1"
    },
    "description": "Introduction to all major areas of information systems. Technology and file systems, organizational and behavioural issues, data modeling, databases, expert systems, systems analysis, systems development life cycle, etc. Development of analytical skills which can be brought to bear on BTM problems. Notes: Students are expected to have basic familiarity with microcomputer applications (word processing, spreadsheets, personal data base, presentation graphics, personal information manager, email, web browser). The lab component will be taught for up to 10 weeks. Students may not receive credit for both BTM 211 and BTM 311.",
    "url": "/catalogue/course/btm/211"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 412",
    "title": "Managerial Support Systems",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Provides students with an understanding of the interaction between decision-making and technology within organizational contexts. Within the context of decision support systems (DSS), focus is on four key components: 1) the technology; 2) the broader context, including the decision-making styles which exist at the organizational, group and individual levels; 3) the design and development of DSS; 4) the effectiveness of DSS to support decision-making processes, including issues of implementation and evaluation. Prerequisite: BTM 311.",
    "url": "/catalogue/course/btm/412"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 413",
    "title": "Systems Analysis and Design",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Examination of the critical stages of the systems development process. These include the initiation, planning, analysis, design, implementation and maintenance of information systems needed to support business functions in organizations. The concepts of life cycle, requirements definition, analysis and design methods, and computer-assisted software engineering (CASE) tools are presented. Specific modeling techniques such as process models, data models and logic models are examined in detail. Hands-on experience with a high-end CASE tool are provided.  Prerequisite: BTM 311.",
    "url": "/catalogue/course/btm/413"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 415",
    "title": "Data Base Design and Administration",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-2"
    },
    "description": "Application of database concepts in organizations. A comprehensive introduction to the design and development of relational databases from a logical data model. The relational database access language SQL is used along with a number of key-software development tools. Effective data administration techniques for enforcing integrity and security as well as enhancing performance are discussed. Topics of special current interest include data warehousing and the object-oriented data model. Prerequisite: BTM 311. Note: There will be a lab component for up to ten weeks during the term.",
    "url": "/catalogue/course/btm/415"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 417",
    "title": "Telecommunications in Business",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "An introduction to fundamental concepts required to understand and apply telecommunication technologies within a business environment. Emphasizes the principles of those technologies to familiarize the students with the fundamental concepts and terminology of telecommunications. Telecommunications equipment, networks, protocols and architectures are introduced and discussed regarding their relevance and impact on business-oriented organizations. Also introduces managerial aspects such as planning, design and performance of telecommunication systems. Prerequisite: BTM 311.",
    "url": "/catalogue/course/btm/417"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 418",
    "title": "Electronic Commerce",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "An examination of the development of electronic commerce in business across a number of different sectors. Using a process modelling approach, traditional vs. electronic business transactions are discussed in business-to-business and business-to-consumer modes; strategies for e-commerce are developed with a focus on the appropriate technical architecture to support business in an electronic marketplace. In particular, requirements of payment systems, and issues of security and privacy are discussed as key considerations in implementation. The course uses software development tools in the implementation of these electronic commerce strategies. Prerequisite: BTM 311.",
    "url": "/catalogue/course/btm/418"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 419",
    "title": "Systems Development Using Advanced Software Tools",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-2"
    },
    "description": "Covers the physical design and implementation of computer systems with modern software development tools. Is a continuation of the systems analysis and design topics introduced in BTM 413 and uses the outcomes of the logical systems analysis and design process to create the actual system. Prerequisite: BTM 413. Corequisites:  BTM 415 and CMPUT 175, or consent of Department. Note: There will be a lab component for up to 12 weeks during the term. Credit may not be obtained for both BTM 419 and CMPUT 301 or 401.",
    "url": "/catalogue/course/btm/419"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 424",
    "title": "Introduction to Information Systems Project Management",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Examines information system development project management. The system development project is a multi-stage activity involving investigation and analysis, scope definition, resource analysis and estimation, timing estimation, cost estimation, scheduling, monitoring, and implementation. Prerequisite: BTM 311.",
    "url": "/catalogue/course/btm/424"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 426",
    "title": "Technology-Enabled Business Process Management",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Focuses on the major operational activities and tasks that have come to be called business processes. Will identify and categorize key business processes, demonstrate process mapping as a method of business process analysis, and demonstrate process redesign principles as a way to better manage these processes. Will feature the role of IT in process redesign. Prerequisite: BTM 311.",
    "url": "/catalogue/course/btm/426"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 427",
    "title": "Information System Security Management",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course focuses on Information System Security from a Managerial point of view. It examines the IT security needs of all business areas. The course covers aspects of threat assessment, policy creation and enforcement, implementation and the hurdles involved, auditing, and forensics. It also looks at the different ways that compromises can occur and how to detect and prevent them from a planning and Disaster Recovery level. A great many real world examples are used as well as exposing the student to current technology that is used in industry. The main focus is from a manager's point of view and teaches planning skills that are important in a field that grows on a daily basis. Prerequisite: BTM 311.",
    "url": "/catalogue/course/btm/427"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 437",
    "title": "Accounting Information Systems",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "An introduction to the field of computerized accounting information systems in organizations from the perspective of the information system professional. Accounting information systems are typically the foundation for many other information systems in organizations. Concentrates on the design of accounting information systems in organizations and integration of accounting information systems with other functional area and management information systems as well as commonalities in the system development process for accounting and other functional area information systems. Prerequisites: ACCTG 311, 322, BTM 311. Credit may be granted for only one of ACCTG 437 or BTM 437.",
    "url": "/catalogue/course/btm/437"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 441",
    "title": "Managing Information Systems: A Senior Management Perspective",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Intended as a capstone course to the BTM Major. Issues, opportunities, and problems involved in the management of information system resources in organizations. These include human resource, financial, policies, standards, and strategic alignment concerns relating to the information systems department. The role of the CIO (Chief Information Officer) will be explored as the focal point for the course. Integrative cases of information systems issues in small, medium and large organizations will be discussed. Prerequisites: BTM 311 and a minimum of one 400-level BTM course, or consent of Department. Open only to fourth year students. Credit will be granted for only one of BTM 414 or 441.",
    "url": "/catalogue/course/btm/441"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 495",
    "title": "Individual Research Project I",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Special Study for advanced undergraduates. Prerequisites: consent of Instructor and Assistant Dean, Undergraduate Program.",
    "url": "/catalogue/course/btm/495"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 496",
    "title": "Individual Research Project II",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Special Study for advanced undergraduates. Prerequisites: BTM 495, consent of  the Instructor and Assistant Dean, Undergraduate Program.",
    "url": "/catalogue/course/btm/496"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 497",
    "title": "Individual Research Project III",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Special Study for advanced undergraduates. Prerequisites: BTM 496, consent of the Instructor and Assistant Dean, Undergraduate Program.",
    "url": "/catalogue/course/btm/497"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 611",
    "title": "Seminar in Information Systems",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-1"
    },
    "description": "Introduction to all major areas of information systems. Technology and file systems, organizational and behavioral issues, data modeling, databases, expert systems, systems analysis, systems development life cycle, etc. Development of analytical skills which can be brought to bear on BTM problems. Notes: Students are expected to have basic familiarity with microcomputer applications. There will be a lab component during the term.",
    "url": "/catalogue/course/btm/611"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 612",
    "title": "Managerial Support Systems",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Provides students with an understanding of the interaction between decision-making and technology within organizational contexts. Within the context of decision support systems (DSS), focus is on four key components: 1) the technology; 2) the broader context, including the decision-making styles which exist at the organizational, group and individual levels; 3) the design and development of DSS; 4) the effectiveness of DSS to support decision-making processes, including issues of implementation and evaluation.",
    "url": "/catalogue/course/btm/612"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 613",
    "title": "Systems Analysis and Design",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course examines the critical stages of the systems development process. These include the initiation, planning, analysis, design, implementation and maintenance of information systems needed to support business functions in organizations. The concepts of life cycle, requirements of definition, analysis and design methods, and computer assisted software engineering (CASE) tools are presented. Specific modeling techniques such as process models, data models and logic models are examined in detail. Hands-on experience with a high-end CASE tool is provided.",
    "url": "/catalogue/course/btm/613"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 615",
    "title": "Data Base Design and Administration",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-2"
    },
    "description": "Application of database concepts in organizations. A comprehensive introduction  to the design and development  of relational databases from a logical data model. The relational database access language SQL is used along with a number of key software development tools. Effective data administration techniques for enforcing integrity and security as well as enhancing performance are also discussed. Topics of special current interest include data warehousing and the object-oriented data model. Note: The lab component will be taught for ten weeks during the term.",
    "url": "/catalogue/course/btm/615"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 618",
    "title": "Electronic Commerce",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "An examination of the development of electronic commerce in business across a number of different sectors. Using a process modelling approach, traditional vs. electronic business transactions are discussed in business-to-business and business-to-consumer modes; strategies for e-commerce are developed with a focus on the appropriate technical architecture to support business in an electronic marketplace. In particular, requirements of payment systems, and issues of security and privacy are discussed as key considerations in implementation. The course uses software development tools in the implementation of these electronic commerce strategies.",
    "url": "/catalogue/course/btm/618"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 624",
    "title": "IT/IS Project Management",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Examines information system development project management. The system development project is a multi-stage activity involving investigation and analysis, scope definition, resource analysis and estimation, timing estimation, cost estimation, scheduling, monitoring, and implementation.",
    "url": "/catalogue/course/btm/624"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 641",
    "title": "Information Systems Management",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Issues, opportunities, and problems involved in the management of information system resources in organizations. These include human resource, financial, policies, standards, and strategic alignment concerns relating to the information systems department. The role of the CIO (Chief Information Officer) will be explored as the focal point for the course. Integrative cases of information systems issues in small, medium and large organizations will be discussed.",
    "url": "/catalogue/course/btm/641"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 686",
    "title": "Selected Topics in Management Information Systems",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Topics may vary from year to year. Students should check with the MBA Office for pre/corequisites of specific sections.",
    "url": "/catalogue/course/btm/686"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 701",
    "title": "Introduction to Management Information Systems Research",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course provides a general introduction to the major research fields of management information systems (MIS). As an introductory seminar, coverage will include current and historical topics appearing in top information systems journals. Discussions will revolve around the reference disciplines and theories used in the BTM literature. Corequisite: MGTSC 705. Prerequisite: A graduate or undergraduate course in management information systems or equivalent. Open to all doctoral students or with the written permission of the instructor. Approval of the Business PhD Program Director is also required for non-PhD students.",
    "url": "/catalogue/course/btm/701"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 702",
    "title": "Advanced Research Topics in Management Information Systems",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course will provide an in-depth introduction to a particular methodology or a particular setting that is relevant to research in management information systems. The topic may vary from year to year. Possible topics include applications of optimal control theory in management information systems and operations management, collaborative communication systems, and quantitative models for management information systems. The required background for students will vary depending on the topic. This course may be appropriate for some graduate students in engineering or computing science. Prerequisite: Written permission of the instructor. Approval of the Business PhD Program Director is also required for non-PhD students.",
    "url": "/catalogue/course/btm/702"
  },
  {
    "department": "BTM",
    "courseCode": "BTM 710",
    "title": "Individual Research",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "",
    "url": "/catalogue/course/btm/710"
  }
]