[
  {
    "department": "NS",
    "courseCode": "NS 103",
    "title": "Canadian Indigenous Language Immersion for Adult Beginners",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SPR/SUM, 3-0-0"
    },
    "description": "An introduction to a Canadian indigenous language in an immersion context. No prior knowledge of the focus language is assumed. Note: This course cannot be used as a substitute for NS 152 nor does it prepare the student for NS 105. A student completing this course may still earn credit in NS 152 at a later date. Not for credit in Faculty of Native Studies degree programs.",
    "url": "/catalogue/course/ns/103"
  },
  {
    "department": "NS",
    "courseCode": "NS 104",
    "title": "The Structure of a Canadian Indigenous Language through Immersion",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SPR/SUM, 3-0-0"
    },
    "description": "This course, delivered in an immersion context, is designed for beginning speakers or semi-speakers with only a basic knowledge of the particular Canadian indigenous language being focused in a given section. Topics include word, sentence, and narrative structure as represented in both oral and written forms of the language. Note: This course cannot be used as a substitute for NS 152 nor does it necessarily prepare the student for NS 105. A student completing this course may still earn credit in NS 152 or 153 at a later date. Not for credit in Faculty of Native Studies degree programs.",
    "url": "/catalogue/course/ns/104"
  },
  {
    "department": "NS",
    "courseCode": "NS 110",
    "title": "Historical Perspectives in Indigenous Studies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "A thematic introduction to the historical relationships, colonial contexts, and social, economic, political and cultural patterns that have shaped the contemporary situation of Indigenous peoples in Canada. Not open to students with credit in NS 210. Sections offered at an increased rate of fee assessment; refer to the Tuition and Fees page in the University Regulations sections of the Calendar.",
    "url": "/catalogue/course/ns/110"
  },
  {
    "department": "NS",
    "courseCode": "NS 111",
    "title": "Contemporary Perspectives in Indigenous Studies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "An introductory survey of current issues affecting Indigenous peoples in Canada and their efforts to confront their colonial relationships with and within Canadian society. Not open to students with credit in NS 211. Sections offered at an increased rate of fee assessment; refer to the Tuition and Fees page in the University Regulations sections of the Calendar.",
    "url": "/catalogue/course/ns/111"
  },
  {
    "department": "NS",
    "courseCode": "NS 115",
    "title": "Indigenous Peoples and Technoscience",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course introduces students to the long and complicated relationships between science and technology fields, broader dynamics of colonialism, and increasing demands for Indigenous governance of the sciences and technologies that affect them.",
    "url": "/catalogue/course/ns/115"
  },
  {
    "department": "NS",
    "courseCode": "NS 152",
    "title": "Introductory Cree",
    "units": {
      "credits": 6,
      "feeIndex": 12,
      "term": "EITHER, 4-0-1"
    },
    "description": "A general introduction to Plains Cree (Y dialect) grammar and vocabulary, with practice in speaking and work in the language laboratory. No prior knowledge of Cree is assumed. Not open to students with matriculation standing in Cree. Note: Students cannot receive credit for NS 152 and NS 153.",
    "url": "/catalogue/course/ns/152"
  },
  {
    "department": "NS",
    "courseCode": "NS 152A",
    "title": "Introductory Cree",
    "units": {
      "credits": 3,
      "feeIndex": 12,
      "term": "TWO TERM, 4-0-1"
    },
    "description": "A general introduction to Plains Cree (Y dialect) grammar and vocabulary, with practice in speaking and work in the language laboratory. No prior knowledge of Cree is assumed. Not open to students with matriculation standing in Cree. Note: Students cannot receive credit for NS 152 and NS 153.",
    "url": "/catalogue/course/ns/152a"
  },
  {
    "department": "NS",
    "courseCode": "NS 152B",
    "title": "Introductory Cree",
    "units": {
      "credits": 3,
      "feeIndex": 12,
      "term": "TWO TERM, 4-0-1"
    },
    "description": "A general introduction to Plains Cree (Y dialect) grammar and vocabulary, with practice in speaking and work in the language laboratory. No prior knowledge of Cree is assumed. Not open to students with matriculation standing in Cree. Note: Students cannot receive credit for NS 152 and NS 153.",
    "url": "/catalogue/course/ns/152b"
  },
  {
    "department": "NS",
    "courseCode": "NS 153",
    "title": "Introduction to the Structure of the Cree Language for Cree Speakers",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 4-0-0"
    },
    "description": "A course designed specifically for fluent speakers of Cree who require an introduction to the Pentland othography writing system and formal training and practice with Cree grammatical structure. The focus is on literacy in the Plains Cree dialect. Note: Students cannot receive credit for NS 152 and NS 153. Prerequisite: NS 105.",
    "url": "/catalogue/course/ns/153"
  },
  {
    "department": "NS",
    "courseCode": "NS 161",
    "title": "Countering Stereotypes of Indigenous Peoples",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course pulls the rug from underneath settler-based constructions of Indigeneity. Taking up the most prevalent stereotypes of Indigenous people, the course will provide context and reflection-based learning to give students the ability to unpack and challenge the narratives that both skew the lived experience of Indigenous peoples and allow the replication of stereotypes that reinforce colonial relationships.",
    "url": "/catalogue/course/ns/161"
  },
  {
    "department": "NS",
    "courseCode": "NS 190",
    "title": "Reading, Writing, and Communicating for Indigenous Studies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Through practical and incremental skill development, and with a focus on Indigenous Studies content, this course explores ways of learning and writing in the university environment and more specifically in the discipline of Indigenous Studies. Students will develop their analytical thinking skills by expanding their competencies in reading, composition, writing, research, and communication. Note: Restricted to students in the Faculty of Native Studies only.",
    "url": "/catalogue/course/ns/190"
  },
  {
    "department": "NS",
    "courseCode": "NS 200",
    "title": "Indigenous | Canada: Looking Forward/Looking Back",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "For students from faculties outside the Faculty of Native Studies with an interest in acquiring a basic familiarity with Indigenous/non-Indigenous relationships, particularly in the lands now called Alberta and Canada. Consists of a survey of historical and contemporary relationships between Indigenous peoples and newcomers, with the aim of expanding the understandings held by many Canadians about these relationships. Not designed for Native Studies majors. Sections offered at an increased rate of fee assessment; refer to the Tuition and Fees page in the University Regulations sections of the Calendar.",
    "url": "/catalogue/course/ns/200"
  },
  {
    "department": "NS",
    "courseCode": "NS 201",
    "title": "Indigenous | Canada: Looking Forward/Looking Back",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "For students from faculties outside the Faculty of Native Studies with an interest in acquiring a basic familiarity with Indigenous/non-Indigenous relationships. Consists of a survey of historical and contemporary relationships between Indigenous peoples and newcomers, with the aim of expanding the understandings held by many Canadians about these relationships. This course will be delivered online. Not open to students with credit in NS 200. Not designed for Native Studies majors. Sections offered at an increased rate of fee assessment; refer to the Tuition and Fees page in the University Regulations sections of the Calendar.",
    "url": "/catalogue/course/ns/201"
  },
  {
    "department": "NS",
    "courseCode": "NS 221",
    "title": "Our Land, Our Life: Dene Self-Determination In Theory and In Practice",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This land-based hands-on course explores through the lens of Indigenous political theorists the historical and ongoing movement for Dene self-determination in Denendeh (NWT), and the processes of colonization and decolonization, land-claims and colonizer-First Nations relationships. Hunting, fish netting and moose hide tanning ground theory in protocols and practice of Dene Laws. Co-taught by professors, leaders and Elders at Dechinta Bush University only. Pre-requisite: Consent of the Faculty",
    "url": "/catalogue/course/ns/221"
  },
  {
    "department": "NS",
    "courseCode": "NS 240",
    "title": "Introduction to Indigenous Legal Issues",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "A critical introduction to Indigenous legal issues in Canada through historical and theoretical interpretations of legislation and major court cases from 1763 to the present. The course problematizes the neutral operation of law in society. It thereafter examines the role of law in the colonial context (with a focus on gender), the development of treaty and Aboriginal rights, the obligations of the crown, the criminalization of Indigenous peoples, and reconciliation. Sections offered at an increased rate of fee assessment; refer to the Tuition and Fees page in the University Regulations sections of the Calendar.",
    "url": "/catalogue/course/ns/240"
  },
  {
    "department": "NS",
    "courseCode": "NS 252A",
    "title": "Intermediate Cree",
    "units": {
      "credits": 3,
      "feeIndex": 12,
      "term": "TWO TERM, 3-0-1"
    },
    "description": "Introduction to more complex grammatical structures; translation to and from Cree; reading of selected texts; oral practice, including conversation and work on individual projects. Prerequisite: NS 152 or 153.",
    "url": "/catalogue/course/ns/252a"
  },
  {
    "department": "NS",
    "courseCode": "NS 252B",
    "title": "Intermediate Cree",
    "units": {
      "credits": 3,
      "feeIndex": 12,
      "term": "TWO TERM, 3-0-1"
    },
    "description": "Introduction to more complex grammatical structures; translation to and from Cree; reading of selected texts; oral practice, including conversation and work on individual projects. Prerequisite: NS 152 or 153.",
    "url": "/catalogue/course/ns/252b"
  },
  {
    "department": "NS",
    "courseCode": "NS 260",
    "title": "Contemporary Indigenous Art",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course is an introduction to the visual forms of contemporary Indigenous art and examines a broad selection of contemporary Indigenous art with an emphasis on the philosophical and cultural statements made through artistic expression. Emphasis will be placed on North American Indigenous artists and their visceral expressions as they explore and challenge issues of racism, cultural appropriation, gender, sexuality, representation and the colonial encounter.",
    "url": "/catalogue/course/ns/260"
  },
  {
    "department": "NS",
    "courseCode": "NS 280",
    "title": "Selected Topics in Indigenous Studies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "",
    "url": "/catalogue/course/ns/280"
  },
  {
    "department": "NS",
    "courseCode": "NS 290",
    "title": "Introduction to Research and Inquiry",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-1"
    },
    "description": "Basic research skills and concepts required in Indigenous Studies will be developed by exploring secondary sources.",
    "url": "/catalogue/course/ns/290"
  },
  {
    "department": "NS",
    "courseCode": "NS 300",
    "title": "Traditional Cultural Foundations I",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Introduces students to the diversity of First Peoples of the Americas. First Nation traditions are treated as aspects of dynamic cultural systems that have enabled them to survive and thrive in the centuries prior to European arrival, to resist assimilation efforts, and to persist as culturally distinct peoples. Prerequisites: NS 110, 111 and 240 or 290 or consent of the Faculty.",
    "url": "/catalogue/course/ns/300"
  },
  {
    "department": "NS",
    "courseCode": "NS 314",
    "title": "History of First Nations of Western Canada",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "A survey of the changes in First Nations and European/Canadian relations in western Canada. Emphasis is on First Nations historical perspectives and analyzing events and issues relevant to the various First peoples of western Canada, including treaties and the history and development of reserves. Prerequisites: NS 110, 111 and 240 or 290 or consent of the Faculty.",
    "url": "/catalogue/course/ns/314"
  },
  {
    "department": "NS",
    "courseCode": "NS 320",
    "title": "Indigenous Politics and Diplomacy",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Surveying political relationships in what is now called Canada, this course analyzes the long- standing tensions in relations between Canada and Indigenous peoples. Drawing on Indigenous perspectives, this course reexamines 300 years of political history, exploring early contact diplomacy, treaty-making, and the subsequent colonial relations that structure the contemporary situation. Prerequisites: NS 110, 111 and 240 or 290 or consent of the Faculty. For students outside of the Faculty of Native Studies, NS 200 or NS 201 is the prerequisite. Sections may be offered in a Cost Recovery format at an increased rate of fee assessment; refer to the Fees Payment Guide in the University Regulations and Information for Students section of the Calendar.",
    "url": "/catalogue/course/ns/320"
  },
  {
    "department": "NS",
    "courseCode": "NS 330",
    "title": "Indigenous Economies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course will review underlying factors which affect the economies of Indigenous communities and examine different approaches to Indigenous economies, including community, alternative, corporate, and entrepreneurial business approaches. Indigenous perspectives to Indigenous Economic Development will be a principal theme. The objective of the course will be to assess approaches to the identification, planning, and implementation of economic strategies for Indigenous communities. Prerequisites: NS 110, 111 and 240 or 290 or consent of the Faculty. For students outside of the Faculty of Native Studies, NS 200 or NS 201 is the prerequisite. Sections may be offered in a Cost Recovery format at an increased rate of fee assessment; refer to the Fees Payment Guide in the University Regulations and Information for Students section of the Calendar.",
    "url": "/catalogue/course/ns/330"
  },
  {
    "department": "NS",
    "courseCode": "NS 335",
    "title": "Indigenous Peoples and the Fur Trade",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Perspectives on the economic, cultural, demographic and geographical aspects of the Canadian fur trade will be explored historically and examined critically. The consequences of the changing relationships between Indigenous peoples and mercantile trading interests will be assessed through lectures and seminars. Prerequisites: NS 110, 111 and 240 or 290, or consent of the Faculty.",
    "url": "/catalogue/course/ns/335"
  },
  {
    "department": "NS",
    "courseCode": "NS 340",
    "title": "Indigenous Legal Systems",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "An introduction to the normative systems of Indigenous peoples in Canada and around the world, often called customary law. Includes considerations of Indigenous legal issues and jurisprudence from various perspectives, including legal histories, conceptions of law, theories of law, and legal pluralism. Prerequisites: NS 110, 111 and 240 or consent of the Faculty. For students outside of the Faculty of Native Studies, NS 200 or NS 201 is the prerequisite. Sections offered at an increased rate of fee assessment; refer to the Tuition and Fees page in the University Regulations sections of the Calendar.",
    "url": "/catalogue/course/ns/340"
  },
  {
    "department": "NS",
    "courseCode": "NS 345",
    "title": "Governance in Indigenous Nations",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "The course will cover important conceptual paradigms in Indigenous Studies related to the governance of Indigenous nations. These include nationhood, critical Indigenous studies, Indigenous resurgence, Indigenous law, Indigenous feminism(s) and relationality. In addition, the course will cover a selection of mainstream governance methods relevant to organizational planning, conflict resolution, and board governance. Prerequisites: NS 110, 111 and 240 or 290 or consent of the Faculty. For students outside of the Faculty of Native Studies, NS 200 or NS 201 is the prerequisite. Sections may be offered in a Cost Recovery format at an increased rate of fee assessment; refer to the Fees Payment Guide in the University Regulations and Information for Students section of the Calendar.",
    "url": "/catalogue/course/ns/345"
  },
  {
    "department": "NS",
    "courseCode": "NS 352A",
    "title": "Advanced Cree",
    "units": {
      "credits": 3,
      "feeIndex": 12,
      "term": "TWO TERM, 3-0-1"
    },
    "description": "An intensive course designed to enable students to acquire considerable facility both in oral communication and in writing, employing both Roman and syllabic orthography. Prerequisite: NS 252.",
    "url": "/catalogue/course/ns/352a"
  },
  {
    "department": "NS",
    "courseCode": "NS 352B",
    "title": "Advanced Cree",
    "units": {
      "credits": 3,
      "feeIndex": 12,
      "term": "TWO TERM, 3-0-1"
    },
    "description": "An intensive course designed to enable students to acquire considerable facility both in oral communication and in writing, employing both Roman and syllabic orthography. Prerequisite: NS 252.",
    "url": "/catalogue/course/ns/352b"
  },
  {
    "department": "NS",
    "courseCode": "NS 355",
    "title": "Indigenous Knowledge and Oral Traditions",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course considers oral traditions as aspects of broader, culturally-defined systems of knowledge, in which stories are vehicles for encoding and transmitting knowledge about the people, their culture, and their history. It focuses on new academic and community-based approaches, as well as the complementarity of oral traditions/Indigenous knowledge and Western science. Students will explore the evolving roles of oral traditions for contemporary Indigenous peoples, including creative expression. Prerequisites: NS 110, 111 and 240 or 290 or consent of the Faculty.",
    "url": "/catalogue/course/ns/355"
  },
  {
    "department": "NS",
    "courseCode": "NS 360",
    "title": "Indigenous Erotics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course is an introductory study of the visual and literary forms of Indigenous erotica in North America. This course will examine a broad selection of historical and contemporary Indigenous expressions of sexuality and gender. The manifestations of the erotic will be examined and understood as a way for Indigenous peoples to reclaim corporeal sovereignty, overcome centuries of sexual repression and shame and revive understandings of gender and sexuality deeply rooted in Indigenous cultural paradigms. Prerequisites: NS 110, NS 111 and NS 260 or NS 290 or consent of the faculty.",
    "url": "/catalogue/course/ns/360"
  },
  {
    "department": "NS",
    "courseCode": "NS 361",
    "title": "Race, Stereotypes, and Indigeneity",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course critically examines the history of race as a set of ideas and processes that have shaped scientific, legal, social and political constructions of Indigeneity, whiteness, and colonial realities in North America. Prerequisites: NS 110, NS 111 and NS 240 or NS 290 or consent of the Faculty.",
    "url": "/catalogue/course/ns/361"
  },
  {
    "department": "NS",
    "courseCode": "NS 362",
    "title": "Indigenous Women",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "An interdisciplinary approach to understanding historical and contemporary experiences of Indigenous women. Examines the ways in which Indigenous women have resisted and been shaped by colonialism and other contemporary racialized gendered practices through an exploration of community, race, gender, sexuality, identity, representation, and activism. The course also considers the ways in which Indigenous knowledge shape alternative ways of conceptualizing and politicizing history, identity, place, self-determination, land rights, resources and wellbeing. Prerequisites: NS 110, 111 and 240 or 290 or consent of the Faculty. For students outside of the Faculty of Native Studies, NS 200 or NS 201 is the prerequisite.",
    "url": "/catalogue/course/ns/362"
  },
  {
    "department": "NS",
    "courseCode": "NS 370",
    "title": "The Métis: The Emergence of a People",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "An examination of the factors responsible for the emergence of Métis communities in different areas at different times, with the emphasis on Canada. The development of Métis people together with lifestyles that serve to distinguish them from others will receive much attention. Where applicable, comparisons with similar experiences elsewhere in the world will be made. Prerequisites: NS 110, 111 and 240 or 290 or consent of the Faculty.",
    "url": "/catalogue/course/ns/370"
  },
  {
    "department": "NS",
    "courseCode": "NS 372",
    "title": "Métis Politics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "An examination of various Métis political debates: identity, recognition, nationalism, political organizing, self-governance structures, constitutionalization of rights, and theories of Indigenous politics. Prerequisites: NS 110, 111 and 240 or 290 or consent of the Faculty. For students outside of the Faculty of Native Studies, NS 200 or NS 201 is the prerequisite. Sections offered at an increased rate of fee assessment; refer to the Tuition and Fees page in the University Regulations sections of the Calendar.",
    "url": "/catalogue/course/ns/372"
  },
  {
    "department": "NS",
    "courseCode": "NS 376",
    "title": "Indigenous Demography and Disease",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course focuses on the historic epidemic diseases that devastated Indigenous communities following the arrival of Europeans in this hemisphere. Students will study evidence for health and disease and for the size of the Indigenous population before contact, the epidemiology and impacts of infectious diseases that accompanied Europeans to the Americas, and the transition to a different disease profile in the 20th century. Indigenous and European approaches to well-being and disease will be considered. Prerequisites: NS 110, 111 and 240 or 290 or consent of the Faculty.",
    "url": "/catalogue/course/ns/376"
  },
  {
    "department": "NS",
    "courseCode": "NS 380",
    "title": "Selected Topics in Indigenous Studies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Prerequisites: NS 110, 111 and 240 or 290 or consent of the Faculty.",
    "url": "/catalogue/course/ns/380"
  },
  {
    "department": "NS",
    "courseCode": "NS 390",
    "title": "Research Methods in Indigenous Studies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "A survey of different disciplinary methods for conducting Indigenous Studies research and data analysis, this course will also review and critique strategies and techniques applied by social science researchers with Indigenous peoples. Prerequisites: NS 110, 111 and 290 or consent of Faculty.",
    "url": "/catalogue/course/ns/390"
  },
  {
    "department": "NS",
    "courseCode": "NS 403",
    "title": "Selected Topics in Indigenous Studies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Prerequisite: One 300-level NS course or consent of the Faculty. Sections may require payment of additional student instructional support fees. Refer to the Fees Payment Guide in the University Regulations and Information for Students section of the Calendar. Sections offered at an increased rate of fee assessment; refer to the Tuition and Fees page in the University Regulations sections of the Calendar.",
    "url": "/catalogue/course/ns/403"
  },
  {
    "department": "NS",
    "courseCode": "NS 404",
    "title": "Selected Topics in Indigenous Studies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Prerequisite: One 300-level NS course or consent of the Faculty.",
    "url": "/catalogue/course/ns/404"
  },
  {
    "department": "NS",
    "courseCode": "NS 405",
    "title": "Selected Topics in International Indigenous Studies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Prerequisite: One 300-level NS course or consent of the Faculty.",
    "url": "/catalogue/course/ns/405"
  },
  {
    "department": "NS",
    "courseCode": "NS 406",
    "title": "Directed Readings in Native Studies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "Prerequisite: Consent of the Faculty.",
    "url": "/catalogue/course/ns/406"
  },
  {
    "department": "NS",
    "courseCode": "NS 420",
    "title": "Partnership Strategies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "An exploration of the theory and practice of creating partnerships and public movement building. Students will be introduced to a number of governance techniques that include interest based negotiations, meeting facilitation and building public narrative. Additionally, students will survey various cases of Indigenous partnerships and public movements. This course will be taught in a seminar format with a heavy focus on simulations. Prerequisite: 3 units in any NS 300 level or consent of the Faculty. Sections offered at an increased rate of fee assessment; refer to the Tuition and Fees page in the University Regulations sections of the Calendar.",
    "url": "/catalogue/course/ns/420"
  },
  {
    "department": "NS",
    "courseCode": "NS 430",
    "title": "Indigenous Governance and Partnership Capstone",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course synthesizes and integrates the range of knowledge and analysis from previous Indigenous governance courses, and normally includes a practical component to enhance the interplay of the theory and actual practice of governance. Prerequisites: 6 units from the list of required and elective courses for the Certificate in Indigenous Governance and Partnership [refer to the Native Studies Certificates section of the calendar], or consent of the Faculty. NS 390 is also recommended. Students intending to complete the Certificate in Indigenous Governance and Partnership should complete all other Certificate requirements first. Sections offered at an increased rate of fee assessment; refer to the Tuition and Fees page in the University Regulations sections of the Calendar.",
    "url": "/catalogue/course/ns/430"
  },
  {
    "department": "NS",
    "courseCode": "NS 435",
    "title": "Management of Indigenous Natural Resources",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "The critical application of knowledge of resource management to the traditional economic activities, especially hunting, fishing and trapping. Diminution and depletion problems, which developed with the spread of the commercial economy, will be analyzed by examining Indigenous and European approaches to management. Prerequisites: Any 6 units in HGP 250, 355, REN R 205, 260 or AUGEO 324, or one 300-level NS course or consent of the Faculty. Sections offered at an increased rate of fee assessment; refer to the Tuition and Fees page in the University Regulations sections of the Calendar.",
    "url": "/catalogue/course/ns/435"
  },
  {
    "department": "NS",
    "courseCode": "NS 440",
    "title": "Indigenous Treaties and Agreements",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "An exploration of the historical and contemporary issues associated with treaties. Pre- and post-1867 Indian treaties and modern agreements in Canada will be examined. Prerequisite: One 300-level NS course or consent of the Faculty.",
    "url": "/catalogue/course/ns/440"
  },
  {
    "department": "NS",
    "courseCode": "NS 441",
    "title": "Indigenous Land Claims and Agreements",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "An exploration of the historical and contemporary issues associated with Indigenous land claims agreements. The background negotiations, and implementation of modern agreements in Canada will be the focus of this course. Prerequisite: One 300-level NS course or consent of the Faculty. NS 440 is also recommended.",
    "url": "/catalogue/course/ns/441"
  },
  {
    "department": "NS",
    "courseCode": "NS 442",
    "title": "Colonialism and the Criminal Justice System",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "Focuses on pertinent aspects of the Canadian criminal justice process as it relates to the experiences of Indigenous peoples. This course examines how the justice process functioned historically, as well as its links to contemporary social relations and institutions such as education and the media. In particular, issues pertaining to historical and emerging trends such as restorative justice and sentencing alternatives are explored and critically analyzed. There is a strong intersectional focus on how racism and discrimination shape Indigenous experiences within the criminal justice process. Prerequisites: NS 110, 111 and one 300-level NS course or consent of the Faculty.",
    "url": "/catalogue/course/ns/442"
  },
  {
    "department": "NS",
    "courseCode": "NS 445",
    "title": "Community Development Processes",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "In a seminar, students will identify, analyze and integrate community development philosophy, principles and practice. The relevance of traditional community development models to Indigenous communities will be critically examined in light of the recent experiences of Indigenous communities themselves. Prerequisites: NS 330 or 345 or 390 or consent of the Faculty. Sections offered at an increased rate of fee assessment; refer to the Tuition and Fees page in the University Regulations sections of the Calendar.",
    "url": "/catalogue/course/ns/445"
  },
  {
    "department": "NS",
    "courseCode": "NS 450",
    "title": "Practicum in Indigenous Studies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, UNASSIGNED"
    },
    "description": "A supervised work-based experience that will permit students to apply Indigenous Studies knowledge in a professional context thereby gaining an appreciation of the work environment. Prerequisites: Successful completion of 90 units, including a minimum of 9 units in Native Studies courses; a minimum GPA of 2.0 on the last 30 units; consent of the Faculty.",
    "url": "/catalogue/course/ns/450"
  },
  {
    "department": "NS",
    "courseCode": "NS 476",
    "title": "Perspectives on Indigenous Peoples Health and Wellbeing",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "A critical overview of the literature and contemporary health issues affecting Indigenous peoples in Canada. Special focus is on the meanings of health, socio-economic and environmental determinants of health and the socio- political landscape of Indigenous health research and healthcare policy. Prerequisites: NS 376 or consent of the Faculty.",
    "url": "/catalogue/course/ns/476"
  },
  {
    "department": "NS",
    "courseCode": "NS 485",
    "title": "Urban Indigenous Issues and Identities",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "Critically examines some of the core issues facing Indigenous peoples living in Canada's cities, with a particular emphasis on how these issues affect the ways that urban Indigenous communities are governed municipally, provincially and federally, as well as how they form their own self-government institutions in urban areas. Prerequisites: NS 110, 111 and one 300-level NS course, or consent of the Faculty. Sections offered at an increased rate of fee assessment; refer to the Tuition and Fees page in the University Regulations sections of the Calendar.",
    "url": "/catalogue/course/ns/485"
  },
  {
    "department": "NS",
    "courseCode": "NS 490",
    "title": "Community-Based Research",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "A seminar exploring the issues in the area of community-based research. The course will be organized primarily around the examination of case studies. Methodological concerns will focus on the political, cultural, ethical, and practical aspects of conducting community-based research in conjunction with Indigenous groups and communities. Prerequisite: NS 390.",
    "url": "/catalogue/course/ns/490"
  },
  {
    "department": "NS",
    "courseCode": "NS 498A",
    "title": "Honors Paper or Project",
    "units": {
      "credits": 3,
      "feeIndex": 12,
      "term": "TWO TERM, 0-3S-0"
    },
    "description": "For students in the Honors program in Indigenous Studies in their final year. Prerequisite: NS 390.",
    "url": "/catalogue/course/ns/498a"
  },
  {
    "department": "NS",
    "courseCode": "NS 498B",
    "title": "Honors Paper or Project",
    "units": {
      "credits": 3,
      "feeIndex": 12,
      "term": "TWO TERM, 0-3S-0"
    },
    "description": "For students in the Honors program in Indigenous Studies in their final year. Prerequisite: NS 390.",
    "url": "/catalogue/course/ns/498b"
  },
  {
    "department": "NS",
    "courseCode": "NS 499",
    "title": "Research Project",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-0-3"
    },
    "description": "The research project is designed to provide students with a variety of options for carrying out their own research. The specific route taken will depend upon the resources of the Faculty, opportunities available in the community, and the skills of the student. While the program is intended to be flexible, the main route around which students may design their projects will be research conducted in conjunction with a local Indigenous organization or community. Prerequisite: consent of the Faculty of Native Studies. Normally consent will not be given without credit in NS 390.",
    "url": "/catalogue/course/ns/499"
  },
  {
    "department": "NS",
    "courseCode": "NS 503",
    "title": "Directed Readings in Indigenous Studies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "Sections may require payment of additional student instructional support fees. Refer to the Tuition and Fees page in the University Regulations section of the Calendar.",
    "url": "/catalogue/course/ns/503"
  },
  {
    "department": "NS",
    "courseCode": "NS 504",
    "title": "Directed Advanced Readings in Indigenous Studies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "Prerequisite: NS 503 or consent of the Faculty.",
    "url": "/catalogue/course/ns/504"
  },
  {
    "department": "NS",
    "courseCode": "NS 520",
    "title": "Theoretical Perspectives in Indigenous Studies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "This seminar introduces students to the history of and various theoretical concepts deemed important to the discipline of Indigenous Studies..",
    "url": "/catalogue/course/ns/520"
  },
  {
    "department": "NS",
    "courseCode": "NS 550",
    "title": "Research Practicum in Indigenous Studies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Students must undertake a 30-hour research project in consultation with an Indigenous organization or community chosen in coordination with the Practicum Coordinator.",
    "url": "/catalogue/course/ns/550"
  },
  {
    "department": "NS",
    "courseCode": "NS 590",
    "title": "Community-Based Research",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "This seminar explores issues in the area of community-based research using case studies and teaches some relevant field research skills using hands-on exercises. Methodological concerns focus on the political, cultural, ethical and practical aspects of conducting community-based research in conjunction with Indigenous groups and communities.",
    "url": "/catalogue/course/ns/590"
  },
  {
    "department": "NS",
    "courseCode": "NS 591",
    "title": "Community-Based Research",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "This seminar explores issues in the area of community-based research using case studies and teaches some relevant field research skills using hands-on exercises. Methodological concerns focus on the political, cultural, ethical and practical aspects of conducting community-based research in conjunction with Native groups and communities.",
    "url": "/catalogue/course/ns/591"
  },
  {
    "department": "NS",
    "courseCode": "NS 592",
    "title": "Archival and Historical Research Methods",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "Students will gain an in-depth understanding of archival research, along with an exposure to the use of computers to capture, compile, analyze and present archival information.",
    "url": "/catalogue/course/ns/592"
  },
  {
    "department": "NS",
    "courseCode": "NS 593",
    "title": "Social Survey Design and Analysis for Indigenous Communities",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "Students will learn research design and data collection strategies useful for small-scale quantitative research in Indigenous communities. Survey research techniques, questionnaire construction and analysis will be emphasized.",
    "url": "/catalogue/course/ns/593"
  },
  {
    "department": "NS",
    "courseCode": "NS 599",
    "title": "Selected Research Topics in Indigenous Studies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "",
    "url": "/catalogue/course/ns/599"
  },
  {
    "department": "NS",
    "courseCode": "NS 604",
    "title": "Directed Readings in Indigenous Studies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "Prerequisite: consent of the Faculty.",
    "url": "/catalogue/course/ns/604"
  },
  {
    "department": "NS",
    "courseCode": "NS 620",
    "title": "Advanced Theoretical Perspectives in Indigenous Studies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "This course engages students with theoretical concepts seminal to the discipline of Indigenous Studies. Students will gain a thorough understanding of the Indigenous Studies theoretical field and will be able to specifically identify theory relevant to their explicit research project. Through Indigenous theory, students will be able to identify ethical issues in relation to research with Indigenous communities.",
    "url": "/catalogue/course/ns/620"
  },
  {
    "department": "NS",
    "courseCode": "NS 655",
    "title": "Professional Seminar",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "This professional development course helps develop the intellectual independence transferable to employment within and outside the academy, including the creativity to solve complex situations through the exercise of responsibility and autonomy. From an Indigenous Studies perspective, this course introduces students to career development and professional issues within the academy, and the public and private sectors. Students will work on developing their research and writing skills to a level that will satisfy peer review and merit publication. Students will work on orally communicating complex ideas cogently, clearly and effectively. Students will work on the technical skills required for writing for different audiences and within the PhD process including, in particular, the preparation of comprehensive and candidacy examinations, as well as completing a dissertation in a timely manner.",
    "url": "/catalogue/course/ns/655"
  },
  {
    "department": "NS",
    "courseCode": "NS 690",
    "title": "Advanced Indigenous Methodologies",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "This course gives students a thorough conceptual understanding of the key methodological principles and research concepts seminal to the discipline of Indigenous Studies. Students will gain proficiency in Indigenous methodologies and the skills to comprehend, design, and implement method relevant to their specific research area, including the use of existing Indigenous methods and the creation of new methods to answer complex research problems. Students will be able to articulate methodological strategies to produce meaningful research 'with' as opposed to 'on' Indigenous communities. Students will begin to develop the skills to carry out advanced research within academic, community and/or applied settings.",
    "url": "/catalogue/course/ns/690"
  }
]