[
  {
    "department": "PALEO",
    "courseCode": "PALEO 200",
    "title": "Introduction to Dinosaurs in the Fossil Record",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Students will learn the fundamental processes of how and what we know about the fossil record, with a special focus on dinosaurs. Topics include fossilization, fossil collection/curation, morphological analysis, organismal evolution, paleoecology, protection of fossils, speciation, stratigraphy, and taphonomy. Students learn how paleontological research determines the ages, behaviour, breeding, life cycles, physiology, sexes and other aspects of the biology of dinosaurs and other extinct animals. This course will be delivered entirely on-line. Prerequisites: Biology 30 or equivalent, or any 100-level course in the Faculty of Science. Note: Students who have obtained credit for PALEO 201 cannot take PALEO 200 for credit.",
    "url": "/catalogue/course/paleo/200"
  },
  {
    "department": "PALEO",
    "courseCode": "PALEO 201",
    "title": "Dinosaurs in the Fossil Record",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "For students who want a deeper understanding of the fossil record, this course will augment the topics of PALEO 200 (fossilization, fossil collection/curation, morphological analysis, organismal evolution, paleoecology, protection of fossils, speciation, stratigraphy, and taphonomy) with field trips to regional museums and dig sites. Students will also learn how paleontological research determines the ages, behaviour, breeding, life cycles, physiology, sexes and other aspects of the biology of dinosaurs and other extinct animals. A portion of this  course will be delivered on-line. Prerequisites: Biology 30 or equivalent, or any 100-level course in the Faculty of Science. Note: Students who have obtained credit for PALEO 200 cannot take PALEO 201 for credit.",
    "url": "/catalogue/course/paleo/201"
  },
  {
    "department": "PALEO",
    "courseCode": "PALEO 202",
    "title": "Early Vertebrate Evolution",
    "units": {
      "credits": null,
      "feeIndex": null,
      "term": null
    },
    "description": "This course encompasses the origin of vertebrates within chordates and explores the diversity of Palaeozoic lineages within a phylogenetic and evolutionary framework. It will examine the evolution of major vertebrate novelties including the origin of fins, jaws and tetrapod limbs, highlighting key Canadian fossil localities. This course will be delivered entirely online. Course materials and activities include video segments, course notes, and learning and evaluation activities. Prerequisites: PALEO 200 or PALEO 201 or BIOL 108.",
    "url": "/catalogue/course/paleo/202"
  },
  {
    "department": "PALEO",
    "courseCode": "PALEO 203",
    "title": "Ancient Marine Reptiles",
    "units": {
      "credits": null,
      "feeIndex": null,
      "term": null
    },
    "description": "This course explores the evolutionary changes that occur when air-breathing terrestrial animals return to water. It will examine the diversity, adaptations, convergence and phylogenetic relationships of three major groups of extinct marine reptiles-the ichythyosaurs, plesiosaurs, and mosasaurs-in addition to some lesser-known groups. Emphasis will be placed on the fossils and fossil localities of Western Canada. This course will be delivered entirely on-line. Course materials and activities include video segments, course notes, and learning and evaluation activities. Prerequisites: PALEO 200 or PALEO 201 or BIOL 108.",
    "url": "/catalogue/course/paleo/203"
  },
  {
    "department": "PALEO",
    "courseCode": "PALEO 204",
    "title": "Theropod Dinosaurs and the Origin of Birds",
    "units": {
      "credits": null,
      "feeIndex": null,
      "term": null
    },
    "description": "This course examines the anatomy, diversity, and evolution of theropod dinosaurs in relation to the origin of birds. Particular attention will be paid to the anatomical characters shared by theropods and birds that enabled birds to evolve powered flight. Various hypotheses for the origin of flight will be discussed. Recent discoveries of relevant fossils from Canada will be highlighted. This course will be delivered entirely online. Course materials and activities include video segments, course notes, and learning and evaluation activities. Prerequisites: PALEO 200 or PALEO 201 or BIOL 108.",
    "url": "/catalogue/course/paleo/204"
  },
  {
    "department": "PALEO",
    "courseCode": "PALEO 400",
    "title": "Paleontology Field School",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 0-1S-6"
    },
    "description": "Students will learn the techniques of collection, curation and analysis of fossils at major dinosaur sites in Western Canada. The field component of the course will take place during the summer at a field station off campus. Each student will complete assignments in the field and will prepare a written report for completion by the end of October based on data acquired and methods learned during the field component. Prerequisite: Consent of Department. Requires payment of additional student instructional support fees. Refer to the Tuition and Fees page in the University Regulations section of the Calendar. [Faculty of Science]",
    "url": "/catalogue/course/paleo/400"
  },
  {
    "department": "PALEO",
    "courseCode": "PALEO 412",
    "title": "Selected Topics in Paleontology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "VAR, 3-0-0"
    },
    "description": "Covers specialized topics of current interest to advanced undergraduates in Biological Sciences and Earth and Atmospheric Sciences. Consult the Paleontology advisor for details about current offerings. Prerequisite: Consent of Instructor. Credit for this course may be obtained more than once. [Faculty of Science]",
    "url": "/catalogue/course/paleo/412"
  },
  {
    "department": "PALEO",
    "courseCode": "PALEO 412A",
    "title": "Selected Topics in Paleontology",
    "units": {
      "credits": 5,
      "feeIndex": 6,
      "term": "VAR, 3-0-0"
    },
    "description": "Covers specialized topics of current interest to advanced undergraduates in Biological Sciences and Earth and Atmospheric Sciences. Consult the Paleontology advisor for details about current offerings. Prerequisite: Consent of Instructor. Credit for this course may be obtained more than once. [Faculty of Science]",
    "url": "/catalogue/course/paleo/412a"
  },
  {
    "department": "PALEO",
    "courseCode": "PALEO 412B",
    "title": "Selected Topics in Paleontology",
    "units": {
      "credits": 5,
      "feeIndex": 6,
      "term": "VAR, 3-0-0"
    },
    "description": "Covers specialized topics of current interest to advanced undergraduates in Biological Sciences and Earth and Atmospheric Sciences. Consult the Paleontology advisor for details about current offerings. Prerequisite: Consent of Instructor. Credit for this course may be obtained more than once. [Faculty of Science]",
    "url": "/catalogue/course/paleo/412b"
  },
  {
    "department": "PALEO",
    "courseCode": "PALEO 414",
    "title": "Paleontology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 3-0-3"
    },
    "description": "Morphology, paleoecology and evolution, with emphasis on both the theoretical aspects and practical techniques of paleontology. Concentration on invertebrate paleontology, but examples from vertebrate paleontology and paleobotany included. Prerequisite: EAS 230. [Faculty of Science]",
    "url": "/catalogue/course/paleo/414"
  },
  {
    "department": "PALEO",
    "courseCode": "PALEO 418",
    "title": "Paleobiology of the Vertebrates I",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 3-0-3"
    },
    "description": "Paleontology, evolution and paleoecology of early chordates, jawless and jawed vertebrates and all non-amniote and amniote tetrapods except synapsids, crocodylomorphs, dinosaurs, and birds, with emphasis on osteology, systematics, major adaptive shifts and subsequent radiations. Prerequisites: ZOOL 325 and any 300 level EAS or Biological Sciences course. Not available to students with credit in PALEO 318. [Faculty of Science]",
    "url": "/catalogue/course/paleo/418"
  },
  {
    "department": "PALEO",
    "courseCode": "PALEO 419",
    "title": "Paleobiology of the Vertebrates II",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 3-0-3"
    },
    "description": "Paleontology, evolution and paleoecology of Synapsida (e.g. therapsids and mammals) and archosaurs (e.g. crocodiles, dinosaurs, and birds) with emphasis on osteology, systematics, major adaptive shifts and subsequent radiations. Prerequisites: ZOOL 325 and any 300 level EAS or Biological Sciences course. Not available to students with credit in PALEO 319. [Faculty of Science]",
    "url": "/catalogue/course/paleo/419"
  },
  {
    "department": "PALEO",
    "courseCode": "PALEO 512",
    "title": "Advanced Selected Topics in Paleontology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "VAR, 3-0-0"
    },
    "description": "Credit for this course may be obtained more than once. Classes concurrent with PALEO 412. [Faculty of Science]",
    "url": "/catalogue/course/paleo/512"
  },
  {
    "department": "PALEO",
    "courseCode": "PALEO 512A",
    "title": "Advanced Selected Topics in Paleontology",
    "units": {
      "credits": 5,
      "feeIndex": 6,
      "term": "VAR, 3-0-0"
    },
    "description": "Credit for this course may be obtained more than once. Classes concurrent with PALEO 412. [Faculty of Science]",
    "url": "/catalogue/course/paleo/512a"
  },
  {
    "department": "PALEO",
    "courseCode": "PALEO 512B",
    "title": "Advanced Selected Topics in Paleontology",
    "units": {
      "credits": 5,
      "feeIndex": 6,
      "term": "VAR, 3-0-0"
    },
    "description": "Credit for this course may be obtained more than once. Classes concurrent with PALEO 412. [Faculty of Science]",
    "url": "/catalogue/course/paleo/512b"
  },
  {
    "department": "PALEO",
    "courseCode": "PALEO 513",
    "title": "Advanced Paleontology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 3-0-3"
    },
    "description": "Morphology, paleoecology and evolution, with emphasis on both the theoretical aspects and practical techniques of paleontology. Concentration on invertebrate paleontology, but examples from vertebrate paleontology and paleobotany included. Classes concurrent with PALEO 414. Not available to students with credit in PALEO 414. [Faculty of Science]",
    "url": "/catalogue/course/paleo/513"
  },
  {
    "department": "PALEO",
    "courseCode": "PALEO 520",
    "title": "Problems in Vertebrate Paleobiology",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-3S-0"
    },
    "description": "[Faculty of Science]",
    "url": "/catalogue/course/paleo/520"
  }
]