[
  {
    "department": "PHYS",
    "courseCode": "PHYS 114",
    "title": "Physics: The Big Picture",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "A qualitative and mostly non-mathematical course in which the overall structure and main concepts of physics are examined. Classical versus quantum worlds; order versus chaos; Newton's versus Einstein's universe; selected topics and issues in modern physics. Prerequisites: Mathematics 30-1. Note: This course does not qualify as an equivalent to high school Physics 30. This course also does not qualify as a prerequisite for 200 or higher level ASTRO, GEOPH, MA PH, or PHYS courses. This course is not intended as preparation for the physics component of the MCAT exam.",
    "url": "/catalogue/course/phys/114"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 124",
    "title": "Particles and Waves",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-3"
    },
    "description": "Algebra-based course primarily for students in life, environmental, and medical sciences. It guides the student through two distinct types of motion: motion of matter (particles) and wave motion. Vectors, forces, bodies in equilibrium, review of kinematics and basic dynamics; conservation of momentum and energy; circular motion; vibrations; elastic waves in matter; sound; wave optics; black body radiation, photons, de Broglie waves. Examples relevant in environmental, life, and medical sciences will be emphasized. Prerequisites: Physics 20 or equivalent, Mathematics 30-1. Physics 30 is strongly recommended. Note: Credit may be obtained for only one of PHYS 124, 144, or EN PH 131. Note: To proceed to PHYS 181 after taking PHYS 124, it is strongly recommended that a minimum grade of B- be achieved in PHYS 124.",
    "url": "/catalogue/course/phys/124"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 126",
    "title": "Fluids, Fields, and Radiation",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-3"
    },
    "description": "A continuation of PHYS 124 primarily for students in life, environmental, and medical science. Fluid statics and dynamics, gases, kinetic interpretation; electrostatics; currents and circuits; magnetic field; electromagnetic induction; nuclear radiation, its interaction with matter and applications. Prerequisite: PHYS 124 or PHYS 144. Note: Credit may be obtained for only one of PHYS 126, 130, 146 or SCI 100.",
    "url": "/catalogue/course/phys/126"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 130",
    "title": "Wave Motion, Optics, and Sound",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-3/2"
    },
    "description": "Geometrical optics, optical instruments, oscillations, waves, sound, interference, diffraction. Prerequisites: Mathematics 30-1, Mathematics 31, Physics 30. Corequisite: MATH 100 or 113 or 114 or 117 or 134 or 144 or equivalent. Restricted to Engineering students. Other students who take this course will receive 3 units.",
    "url": "/catalogue/course/phys/130"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 144",
    "title": "Newtonian Mechanics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 3-0-3"
    },
    "description": "This calculus-based course introduces the fundamentals of classical mechanics: general kinematics, Newtonian dynamics, work-energy and energy conservation, impulse-momentum and momentum conservation, rotational kinematics and dynamics, rigid bodies, angular momentum and its conservation. The course concludes with a discussion of the elastic deformation of solids and simple fluid mechanics. Prerequisites: Mathematics 30-1 and Physics 30. Mathematics 31 is strongly recommended. Corequisites: MATH 117 or 144. Note: Credit may be obtained for only one of PHYS 124, 144 or EN PH 131.",
    "url": "/catalogue/course/phys/144"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 146",
    "title": "Fluids and Waves",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 3-0-3"
    },
    "description": "A calculus-based course for students majoring in the physical sciences. Fluid statics and dynamics, elasticity and simple harmonic motion; sound waves, wave properties of light; quantum waves, wave-particle duality. Prerequisite: PHYS 124 (see Note following) or 144. Corequisite: MATH 118 or 146. Note: MATH 115 is not acceptable as a co-requisite but may be used as a pre-requisite in place of MATH 118 or 146. Note: Credit may be obtained for only one of PHYS 126, 130, 146 or SCI 100. Note: To proceed to PHYS 146 after taking PHYS 124, it is strongly recommended that a minimum grade of B- be achieved in PHYS 124.",
    "url": "/catalogue/course/phys/146"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 181",
    "title": "Relativity, Electricity and Magnetism",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 3-0-3"
    },
    "description": "This calculus-based course starts with the breakdown of the Galilean concepts of space and time near the speed of light, and an introduction to Einstein's Special Relativity including: time dilation, length contraction, Lorentz transformations, relativistic energy and momentum, relativistic Doppler effect and basic 4-vectors. The second part of the course covers introductory electromagnetism including: electric forces and fields, electric potential, capacitance, DC circuits, magnetic forces and fields, magnetic fields from currents, and Faraday's Law of electromagnetic induction. Prerequisite: PHYS 124 (see Note following) or 144 or EN PH 131. Corequisite: One of MATH 118 or 146. Credit may be obtained for only one of PHYS 181 or 230 or 281. Note: To proceed to PHYS 181 after taking PHYS 124, it is strongly recommended that a minimum grade of B- be achieved in PHYS 124.",
    "url": "/catalogue/course/phys/181"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 208",
    "title": "Aspects of Modern Physics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Experimental evidence for limitations of classical physics; Einstein's special theory of relativity; length contraction; time dilation; twin paradox; equivalence of mass and energy; relativistic mass and momentum; the photo-electric effect, the Compton effect, X-ray production and electron diffraction; a discussion of the Heisenberg uncertainty principle and the Schrödinger equation including applications of one dimensional potential wells and barriers; tunnelling; the simple harmonic oscillator; atomic physics; hydrogen atom; periodic table. Prerequisites: one of PHYS 124, PHYS 144, or EN PH 131, and one of PHYS 126, PHYS 146, 181, or PHYS 130; MATH 114 or 134 or 144 or 154. Note: This course may not be taken for credit if credit has already been obtained in PHYS 271.",
    "url": "/catalogue/course/phys/208"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 230",
    "title": "Electricity and Magnetism",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-3/2"
    },
    "description": "Electric fields, Gauss' Law; electric potential; capacitance and dielectrics; electric current and resistance; magnetic fields, Ampere's Law; Faraday's Law; inductance; magnetic properties of matter. Prerequisites: PHYS 130 or 144 or 146, and MATH 100 or 114 or 117 or 144. Corequisite: MATH 101 or 115 or 118. Note: Restricted to Engineering students. Other students who take this course will receive 3 units. Credit can normally be obtained for only one of PHYS 181, 230, or 281.",
    "url": "/catalogue/course/phys/230"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 234",
    "title": "Introductory Computational Physics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-3"
    },
    "description": "An introductory course on using computer based methods to solve physics problems, especially those that do not have analytical solutions or require great effort to find it. Examples of problems are drawn from mechanics, electricity and magnetism, modern physics, experimental physics, and data analysis. The course begins with an introduction to scientific programming. The topics that are covered include numerical differentiation and integration; vector geometry and linear algebra; solutions to ordinary differential equations including nonlinear equations and coupled systems of equations. Other topics will be selected from numerical methods and algorithms for analysis of physics data including root finding methods, interpolation, uncertainty estimates, an introduction to regression, Monte Carlo methods, common statistical distributions encountered in physics, Fourier analysis, signal processing and eigenvalue methods. Prerequisite: PHYS 146 or PHYS 181; MATH 118 or 146. Note: MA PH 251 or MATH 334 is a suggested corequisite.",
    "url": "/catalogue/course/phys/234"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 244",
    "title": "Classical Mechanics I",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 3-0-0"
    },
    "description": "An intermediate course in classical mechanics, which covers several applications that are critical to a wide variety of different fields of physics including: simple, damped, and driven harmonic oscillators; coupled oscillators, conservative forces, and energy. The central part of the course introduces the calculus of variations and Lagrangian mechanics, including its application to the two-body, central force problem and Noether's theorem, which connects symmetries with conservation laws. Hamiltonian mechanics is also briefly introduced. The course concludes with the application of the linear wave equation to mechanical waves: the superposition principle, wave interference, and standing waves. Prerequisite: PHYS 124 or PHYS 144 or EN PH 131. Corequisites: MATH 102 or 125 or 127 or equivalent; MA PH 251 or MATH 201 or MATH 334 or MATH 336.",
    "url": "/catalogue/course/phys/244"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 261",
    "title": "Physics of Energy",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Energy in its various forms; conservation of energy; basic thermodynamics of ideal gases and phase changes; heat engines and refrigerators; consumption of energy resources; space heating and heat transfer; radioactivity; nuclear fission and nuclear power; alternative and renewable energy resources. Prerequisites: one of PHYS 124, PHYS 144, or EN PH 131, and one of PHYS 126, PHYS 146, PHYS 181, or PHYS 130; and MATH 114 or 134 or 144 or 154.",
    "url": "/catalogue/course/phys/261"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 271",
    "title": "Introduction to Modern Physics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 3-0-0"
    },
    "description": "This course covers the emergence of modern physics through revisions to the Newtonian worldview and the development of quantum mechanics. The course starts with the discovery of the wave nature of light through diffraction and interferometry leading to the observation of lines in atomic spectra. The course then discusses the early experiments that lead to the discovery of the structure of matter and early quantum phenomena including: Rutherford scattering, quantization of charge and energy, Blackbody radiation, Compton scattering, Bohr atom and de Broglie wavelength. This is followed by an introduction to the Schrödinger equation and solutions to 1D problems including: infinite and finite square potential wells, the quantum harmonic oscillator and quantum tunneling, before discussing quantized angular momentum. The course then concludes with a tour of the exciting applications of modern physics in different fields with some possible examples including: semiconductors, superconductors, nuclear decays and reactions, the Standard Model, the Higgs boson, quantum information, supernovae and Black Holes, Dark Matter, the Big Bang and Gravitational Waves. Prerequisite: one of PHYS 124, PHYS 144, or EN PH 131. Corequisites: MA PH 251 or MATH 201 or MATH 334 or MATH 336 and one of MA PH 351 or MATH 209 or 315 or 317, and MATH 102 or 125 or 127.",
    "url": "/catalogue/course/phys/271"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 281",
    "title": "Electricity and Magnetism",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Electric fields; Gauss' law; electric potential; capacitance and dielectrics; electric current and resistance; DC circuits; magnetic fields; Ampere's Law; Faraday's Law; inductance; magnetic properties of matter, AC circuits; Maxwell's equations; electromagnetic waves. Prerequisite: one of PHYS 124, PHYS 144, or EN PH 131, and one of PHYS 126, PHYS 146, or PHYS 130. Corequisite: MATH 209 or 214 or 217 or equivalent. Credit may normally be obtained for only one of PHYS 181 or 230 or 281.",
    "url": "/catalogue/course/phys/281"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 292A",
    "title": "Experimental Physics for Engineers",
    "units": {
      "credits": 5,
      "feeIndex": 6,
      "term": "TWO TERM, 0-0-3"
    },
    "description": "Experiments in mechanics, electromagnetism and atomic physics. Corequisites: PHYS 244 or 281 or 230, and MATH 209 or 214 or equivalent. Note: Restricted to Engineering students.",
    "url": "/catalogue/course/phys/292a"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 292B",
    "title": "Experimental Physics for Engineers",
    "units": {
      "credits": 5,
      "feeIndex": 6,
      "term": "TWO TERM, 0-0-3"
    },
    "description": "Experiments in mechanics, electromagnetism and atomic physics. Corequisites: PHYS 244 or 281 or 230, and MATH 209 or 214 or equivalent. Note: Restricted to Engineering students.",
    "url": "/catalogue/course/phys/292b"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 294",
    "title": "General Physics Laboratory",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-0-6"
    },
    "description": "Introduction to experimental physics through select, classic experiments in physics from the 19th through 21st centuries performed using contemporary instrumentation when possible. Introduction to the statistical treatment of uncertainties, and analysis and graphing of experimental data with open-source scientific software. Skill development in written and oral presentation of laboratory results. Prerequisites: MATH 100 or 114 or 117 or 134 or 144 or 154; one of PHYS 124, PHYS 144, or EN PH 131; and one of PHYS 126, PHYS 146, PHYS 181 or PHYS 130. Note: PHYS 294 will not count towards degree credit for Honors programs offered by the physics department (including physics, geophysics, astrophysics and mathematical physics). Students enrolled in those Honors programs are required to take PHYS 295 instead.",
    "url": "/catalogue/course/phys/294"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 295",
    "title": "Experimental Physics I",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-0-6"
    },
    "description": "Contemporary methods of experimental physics with measurements from classical and modern physics. Analysis and graphing of experimental data using programming techniques. Estimation and statistical treatment of experimental uncertainties consistent with standard practice in physics. Planning and record keeping for experimental work, written presentation of laboratory results. Prerequisites: MATH 101 or 115 or 118 or 146, one of PHYS 124, PHYS 144, or EN PH 131; and one of PHYS 126, PHYS 146, PHYS 181, or PHYS 130. Note: To proceed to PHYS 295 after taking PHYS 126 a minimum grade of B+ in PHYS 126 and some experience of computer programming are strongly recommended.",
    "url": "/catalogue/course/phys/295"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 297",
    "title": "Experimental Physics II",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-0-6"
    },
    "description": "Contemporary methods of experimental physics with measurements from classical and modern physics. This is a continuation of Experimental Physics I with application of more advanced techniques and more in-depth exploration of the selected physics topics. Prerequisite: PHYS 295. Corequisites: PHYS 271, and MATH 101 or 115 or 118 or 146.",
    "url": "/catalogue/course/phys/297"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 301",
    "title": "Particles, Nuclei, and the Cosmos",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Relativity; properties and structure of the nucleus; radioactivity, carbon dating, tracer techniques; nuclear fission; fusion; nuclear reactors; elementary particles and particle accelerators; standard model; astrophysics; cosmology. Prerequisite: PHYS 208 or 271; MATH 101 or 115 or 118 or 136 or 146 or 156 or SCI 100. Note: This course is not available for credit toward Honors Physics and Mathematical Physics degree programs. Offered alternate years only. Consult Department for course scheduling.",
    "url": "/catalogue/course/phys/301"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 308",
    "title": "Statistical, Molecular, and Solid State Physics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Classical and quantum statistics; fermions; bosons; molecular structure and spectra; molecular bonding; vibrational and rotational states; absorption; stimulated emission; population inversion; lasers; solid state physics; crystal structure; free-electron gas in metals; band theory of solids; semiconductors; semiconductor devices; superconductivity. Prerequisites: PHYS 208 or 271; MATH 101 or 115 or 118 or 136 or 146 or 156 or SCI 100. Note: Not available for credit towards Honours Physics and Mathematical Physics degree programs. Offered alternate years only. Consult Department for course scheduling.",
    "url": "/catalogue/course/phys/308"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 310",
    "title": "Thermodynamics and Kinetic Theory",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Temperature: heat, work, and the first law of thermodynamics; entropy and the second law, enthalpy, Helmholtz and Gibbs free energy; thermodynamic equilibrium criteria; Maxwell's relations, phase transitions; elementary kinetic theory of gases. Prerequisites: one of PHYS 124, PHYS 144, or EN PH 131, and one of PHYS 126, PHYS 146, PHYS 181, or PHYS 130. Corequisite: MATH 209 or 215 or 315 or 317 or MA PH 351 or equivalent.",
    "url": "/catalogue/course/phys/310"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 311",
    "title": "Statistical Physics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Quantum states, probability distributions, temperature and entropy; canonical ensemble and the partition function; ideal gases, paramagnets; blackbody radiation. Debye model for phonons; quantum statistics; Fermi-Dirac distribution and electrons in metals; Bose-Einstein distribution. Prerequisites: PHYS 310 (or CH E 243 for Engineering Physics Program students), PHYS 271 and MATH 209 or 215 or 315 or 317 or MA PH 351 equivalent.",
    "url": "/catalogue/course/phys/311"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 362",
    "title": "Optical Physics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Electromagnetic waves; polarization and birefringence; dispersion of light in materials; Fresnel equations for reflection and transmission; multiple-beam interference; Fraunhofer and Fresnel diffraction; Fourier optics; coherence theory; optical imaging and instruments; introduction to laser physics, quantum optics, and selected current topics. Prerequisite: PHYS 181 or 230 or 281, and MATH 209 or 215 or 315 or 317 or MA PH 351.",
    "url": "/catalogue/course/phys/362"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 364",
    "title": "Environmental Physics II",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Calculation of pollutant concentrations using principles of materials balance; vertical variation of pressure and temperature in the atmosphere; atmospheric stability and the dispersal of air pollutants; water vapour and humidity; blackbody radiation and Earth's global energy balance; molecular absorption of electromagnetic radiation; the ozone problem; the radon problem. Prerequisites: PHYS 261, and MATH 101 or 115 or 118 or 136 or 146 or 156 or SCI 100. Offered alternate years only. Consult Department for course scheduling.",
    "url": "/catalogue/course/phys/364"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 372",
    "title": "Quantum Mechanics A",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Origins of quantum mechanics; wave functions; Schrodinger equation and its application to one dimensional systems, postulates and physical interpretation of quantum mechanics; orbital angular momentum, central potentials and three-dimensional systems. Prerequisites: PHYS 244, PHYS 271, MATH 334 or 201 or MA PH 251.",
    "url": "/catalogue/course/phys/372"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 381",
    "title": "Electromagnetic Theory I",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Review of scalar and vector fields; Gauss and Stokes theorems; curvilinear coordinates; Dirac delta function; electrostatic field and potential; electrostatic energy; conductors, capacitors; Laplace's equation; boundary value problems; methods of images; multipoles; electrostatic field in matter; polarization; displacement; linear dielectrics; magnetostatic field; Biot-Savart and Ampere's law; vector potential; magnetostatic field in matter; magnetization; linear and nonlinear magnetic media. Prerequisites: PHYS 181 or 230 or 281; MA PH 251 or MATH 201 or 337; MA PH 351 or MATH 209 or 315 or 317.",
    "url": "/catalogue/course/phys/381"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 397",
    "title": "Projects in Experimental Physics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-0-6"
    },
    "description": "Projects from core physics topics including classical and quantum optics, particle physics, solid state physics and surface science. Students master the fundamental skills for work in research labs and related settings through design and execution of experimental projects. Prerequisite: PHYS 292 or 297, and PHYS 381. Corequisite MATH 337 or ECE 341 or equivalent.",
    "url": "/catalogue/course/phys/397"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 399",
    "title": "Research Experience in Physics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-1.5S-6"
    },
    "description": "A credit/no-credit course for developing research skills and participating in a research project under the direction of a member of the Department. Prerequisites: One of PHYS 295 or PHYS 234. Two of BIOPH 201, PHYS 244, PHYS 271, PHYS 297, MA PH 251, MA PH 351. Corequisite: One of GEOPH 326, GEOPH 325, PHYS 310, PHYS 311, PHYS 362, PHYS 372, PHYS 381. Students cannot obtain credit for PHYS 399 if they have previously earned credit in or are concurrently enrolled in PHYS 499 or MA PH 499.",
    "url": "/catalogue/course/phys/399"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 415",
    "title": "Introduction to Condensed Matter Physics I",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Lattice structure and binding; lattice vibrations; electrons in solids, band structure of metals, Fermi surface; semiconductors and junctions; paramagnetism and diamagnetism; introduction to lattice defects. Prerequisites: PHYS 311 and 372, and MA PH 251 or MATH 337 or ECE 341 or equivalent.",
    "url": "/catalogue/course/phys/415"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 420",
    "title": "Computational Physics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-3"
    },
    "description": "Basic principles; computational methods selected from finite-differences, matrix manipulation, variational techniques, discrete transforms, stochastic methods, lattice techniques; as applied to topics selected from nonlinear mechanics, chaotic systems; electrodynamics; wave propagation; statistical physics; quantum mechanics; condensed matter. Prerequisites: PHYS 234, 244, PHYS 381, MA PH 251 or MATH 337 or ECE 341 or equivalent. Recommended pre- or corequisites: MA PH 343, PHYS 311, PHYS 372, PHYS 472, and PHYS 481. Familiarity with a programming language strongly recommended.",
    "url": "/catalogue/course/phys/420"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 458",
    "title": "Special and General Relativity",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Special Relativity: space-time; Lorentz transformations; definitions of scalars, vectors and tensors; motion of a relativistic particle; energymomentum tensor and equations of motion; transformation of electromagnetic fields. General Relativity: geometry of curved space-time; equivalence principle; gravity as curvature; Einstein equations; black hole and cosmological solutions; gravitational waves. Prerequisites: MA PH 251 or MATH 337 or ECE 341, PHYS 244. Corequisite: PHYS 481.",
    "url": "/catalogue/course/phys/458"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 467",
    "title": "Fundamentals of Continuum Mechanics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Cartesian tensors; stress; strain and deformation; Eulerian and Lagrangian descriptions of motions; conservation principles, Cauchy's equation of motion; constitutive relations, elasticity, plasticity, linear and nonlinear viscous fluid flow; elastic wave equation and Navier-Stokes equation; similarity, scaling and nondimensionalisation of governing equations. Applications from geophysics, materials science, oceanography, and atmospheric physics. Pre- or corequisites: MA PH 251 or MATH 337 or ECE 341, PHYS 381.",
    "url": "/catalogue/course/phys/467"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 472",
    "title": "Quantum Mechanics B",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Review of the postulates of quantum mechanics; quantization of angular momentum; matrix representations, spin and parity; approximation methods; perturbation theory; variational and other methods; applications; scattering theory; systems of identical particles. Prerequisites: PHYS 372, and MA PH 251 or MATH 337 or ECE 341 or equivalent, and MATH 311 or 411 or MA PH 351.",
    "url": "/catalogue/course/phys/472"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 481",
    "title": "Electromagnetic Theory II",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Electromotive force; Faraday's law; inductance; Maxwell's equations in free space and in matter; electromagnetic potentials; gauges; energy and momentum conservation laws; plane waves in vacuum, in nonconducting and in conducting media; reflection and refraction of electromagnetic waves; dispersion, wave guides; dipole radiation; radiation due to moving charge; radiation reaction. Prerequisite: PHYS 381, and MA PH 251 or MATH 337 or ECE 341 or equivalent.",
    "url": "/catalogue/course/phys/481"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 485",
    "title": "Introductory Particle Physics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Particles and forces; relativistic kinematics; symmetries and conservation laws; bound states, heavy flavours, and the quark model; Dirac equation and the electrodynamics of leptons; electrodynamics of quarks and the parton model; quantum chromodynamics and the strong interactions; weak interactions and electroweak unification. Prerequisites: PHYS 372; MATH 225 or 227; MA PH 251 or MATH 337 or equivalent. Recommended: PHYS 458 and PHYS 472.",
    "url": "/catalogue/course/phys/485"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 495",
    "title": "Special Topics in Physics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "The course covers specialized topics of interest to advanced undergraduate students. Consult the Department for details about current offerings. Prerequisites depend on the subject. Credit for this course may be obtained more than once.",
    "url": "/catalogue/course/phys/495"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 499",
    "title": "Undergraduate Research Project",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-0-6"
    },
    "description": "Undergraduate physics research project under the direction of a faculty member. Projects must involve a strong physics connection and involve some original research component. Prerequisites: A 300-level PHYS course and consent of the department. This course may be repeated but a student may obtain at most 6 units in PHYS 499 and MA PH 499.",
    "url": "/catalogue/course/phys/499"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 511",
    "title": "Advanced Quantum Mechanics I",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "FIRST, 3-0-0"
    },
    "description": "Principles of quantum mechanics; central force problems; angular momentum; approximation methods for stationary states; time-dependent perturbation theory; scattering theory; identical particles and second quantization; quantum statistical mechanics.",
    "url": "/catalogue/course/phys/511"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 512",
    "title": "Advanced Quantum Mechanics II",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "SECOND, 3-0-0"
    },
    "description": "Time-dependent scattering theory; relativistic quantum mechanics; Klein-Gordon and Dirac equations; introduction to quantum field theory.",
    "url": "/catalogue/course/phys/512"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 524",
    "title": "Classical Electrodynamics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Wave guides, radiating systems; special relativity, dynamics of relativistic particles and electromagnetic fields; radiation by moving charges; multiple fields. Additional special topics will be discussed.",
    "url": "/catalogue/course/phys/524"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 530",
    "title": "Statistical Mechanics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Fundamentals of classical and quantum statistical mechanics, with selected applications.",
    "url": "/catalogue/course/phys/530"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 541",
    "title": "Condensed Matter Physics I",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Crystal structure and symmetries; electrons and band structure; semiconductors and heterostructures; lattice vibrations and thermal properties.",
    "url": "/catalogue/course/phys/541"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 574",
    "title": "Data Analysis in Physics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course teaches the principles for designing physics experiments and analyzing data to obtain robust results. It explores the choice of experimental methods and conditions used for data collection and examines important techniques used for data analysis. Topics include: experimental and numerical noise/background sources, characteristics, and mitigation; sampling, replicates, and controls; probability distributions; parameter estimation; error estimation and confidence levels; model selection, model fitting, and hypothesis testing; non-parametric analyses; applications of frequentist and Bayesian statistics; modes of failure in measurements and analysis.",
    "url": "/catalogue/course/phys/574"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 580",
    "title": "Computational Physics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-3"
    },
    "description": "Basic principles; computational methods selected from finite-differences, matrix manipulation, variational techniques, discrete transforms, stochastic methods, lattice techniques; as applied to topics selected from nonlinear mechanics, chaotic systems; electrodynamics; wave propagation; statistical physics; quantum mechanics; condensed matter. Prerequisite: Consent of Instructor.",
    "url": "/catalogue/course/phys/580"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 590",
    "title": "Particle Physics II",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "Field theory and symmetries; gauge theories; spontaneous symmetry breaking; electroweak interactions of quarks and leptons; quantum chromodynamics; unified theories.",
    "url": "/catalogue/course/phys/590"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 595",
    "title": "Special Topics in Physics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "This course covers specialized topics of interest to junior graduate students. Consult the Department for details about current offerings. Prerequisite: Consent of Instructor. Credit for this course may be obtained more than once.",
    "url": "/catalogue/course/phys/595"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 597",
    "title": "Graduate Projects in Experimental Physics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 0-0-6"
    },
    "description": "Projects from core physics topics including classical and quantum optics, particle physics, solid state physics and surface science, chosen to support the students research capabilities. Students master the advanced skills for work in research labs through design and execution of experimental projects. Prerequisite: Consent of department. Recommended corequisite: PHYS 574",
    "url": "/catalogue/course/phys/597"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 610",
    "title": "Quantum Field Theory I",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "",
    "url": "/catalogue/course/phys/610"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 635",
    "title": "Statistical Theory of Plasmas",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "",
    "url": "/catalogue/course/phys/635"
  },
  {
    "department": "PHYS",
    "courseCode": "PHYS 699",
    "title": "Special Topics in Theoretical Physics",
    "units": {
      "credits": 3,
      "feeIndex": 6,
      "term": "EITHER, 3-0-0"
    },
    "description": "",
    "url": "/catalogue/course/phys/699"
  }
]